RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc567x.h
        uint32_t PBRIDGE_A_reserved0024[7];  /* 0x0024-0x003F */

        union {                 /* Off-Platform Peripheral Access Control Register 0 */
            uint32_t R;
            struct {
                uint32_t BW0:1;  /* FMPLL */
                uint32_t SP0:1;
                uint32_t WP0:1;
                uint32_t TP0:1;
                uint32_t BW1:1;  /* EBI control */
                uint32_t SP1:1;
                uint32_t WP1:1;
                uint32_t TP1:1;
                uint32_t BW2:1;  /* Flash A control */
                uint32_t SP2:1;
                uint32_t WP2:1;
                uint32_t TP2:1;
                uint32_t BW3:1;  /* Flash B control */
                uint32_t SP3:1;
                uint32_t WP3:1;
                uint32_t TP3:1;
                uint32_t BW4:1;  /* SIU */
                uint32_t SP4:1;
                uint32_t WP4:1;
                uint32_t TP4:1;
                uint32_t:4;      /* Reserved */
                uint32_t:4;      /* Reserved */
                uint32_t:4;      /* Reserved */
            } B;
        } OPACR0;

        union {                 /* Off-Platform Peripheral Access Control Register 1 */
            uint32_t R;
            struct {
                uint32_t BW0:1;  /* EMIOS */
                uint32_t SP0:1;
                uint32_t WP0:1;
                uint32_t TP0:1;
                uint32_t:4;      /* Reserved */
                uint32_t:4;      /* Reserved */
                uint32_t:4;      /* Reserved */
                uint32_t:4;      /* Reserved */
                uint32_t:4;      /* Reserved */
                uint32_t:4;      /* Reserved */
                uint32_t BW7:1;  /* PMC */
                uint32_t SP7:1;
                uint32_t WP7:1;
                uint32_t TP7:1;
            } B;
        } OPACR1;

        union {                 /* Off-Platform Peripheral Access Control Register 2 */
            uint32_t R;
            struct {
                uint32_t BW0:1;  /* eTPU */
                uint32_t SP0:1;
                uint32_t WP0:1;
                uint32_t TP0:1;
                uint32_t:4;      /* Reserved */
                uint32_t BW2:1;  /* eTPU PRAM */
                uint32_t SP2:1;
                uint32_t WP2:1;
                uint32_t TP2:1;
                uint32_t BW3:1;  /* eTPU PRAM mirror */
                uint32_t SP3:1;
                uint32_t WP3:1;
                uint32_t TP3:1;
                uint32_t BW4:1;  /* eTPU SCM */
                uint32_t SP4:1;
                uint32_t WP4:1;
                uint32_t TP4:1;
                uint32_t BW5:1;  /* eTPU SCM */
                uint32_t SP5:1;
                uint32_t WP5:1;
                uint32_t TP5:1;
                uint32_t:4;      /* Reserved */
                uint32_t:4;      /* Reserved */
            } B;
        } OPACR2;

        union {                 /* Off-Platform Peripheral Access Control Register 3 */
            uint32_t R;
            struct {
                uint32_t:4;      /* Reserved */
                uint32_t:4;      /* Reserved */
                uint32_t:4;      /* Reserved */
                uint32_t:4;      /* Reserved */
                uint32_t BW4:1;  /* PIT/RTI  */
                uint32_t SP4:1;
                uint32_t WP4:1;
                uint32_t TP4:1;
                uint32_t:4;      /* Reserved */
                uint32_t:4;      /* Reserved */
                uint32_t:4;      /* Reserved */
            } B;
        } OPACR3;

        uint32_t PBRIDGE_A_reserved0050[4076];  /* 0x0050-0x3FFF */

    };

/****************************************************************************/
/*                          MODULE : PBRIDGE_B Peripheral Bridge            */
/****************************************************************************/

    struct PBRIDGE_B_tag {

        union {                 /* Master Privilege Control Register 0 */
            uint32_t R;
            struct {
                uint32_t MBW0:1;      /* z7 Core */
                uint32_t MTR0:1;
                uint32_t MTW0:1;
                uint32_t MPL0:1;
                uint32_t MBW1:1;      /* Nexus */
                uint32_t MTR1:1;
                uint32_t MTW1:1;
                uint32_t MPL1:1;
                uint32_t MBW2:1;      /* Reserved */
                uint32_t MTR2:1;
                uint32_t MTW2:1;
                uint32_t MPL2:1;
                uint32_t MBW3:1;      /* Reserved */
                uint32_t MTR3:1;
                uint32_t MTW3:1;
                uint32_t MPL3:1;
                uint32_t MBW4:1;      /* eDMA A */
                uint32_t MTR4:1;
                uint32_t MTW4:1;
                uint32_t MPL4:1;
                uint32_t MBW5:1;      /* eDMA B */
                uint32_t MTR5:1;
                uint32_t MTW5:1;
                uint32_t MPL5:1;
                uint32_t MBW6:1;      /* FLEXRAY */
                uint32_t MTR6:1;
                uint32_t MTW6:1;
                uint32_t MPL6:1;
                uint32_t MBW7:1;      /* EBI */
                uint32_t MTR7:1;
                uint32_t MTW7:1;
                uint32_t MPL7:1;
            } B;
        } MPCR;

        union {                 /* Master Privilege Control Register 1 */
            uint32_t R;
            struct {
               uint32_t:32;     /* Reserved */

            } B;
        } MPCR1;

        uint32_t PBRIDGE_B_reserved0008[6];  /* 0x0008-0x001F */

        union {                 /* Peripheral Access Control Register 0 */
            uint32_t R;
            struct {
                uint32_t BW0:1;  /* PBRIDGE B */
                uint32_t SP0:1;
                uint32_t WP0:1;
                uint32_t TP0:1;
                uint32_t BW1:1;  /* XBAR  */
                uint32_t SP1:1;
                uint32_t WP1:1;
                uint32_t TP1:1;
                uint32_t:4;      /* Reserved */
                uint32_t:4;      /* Reserved */
                uint32_t BW4:1;  /* MPU */
                uint32_t SP4:1;
                uint32_t WP4:1;
                uint32_t TP4:1;
                uint32_t:4;      /* Reserved */
                uint32_t:4;      /* Reserved */
                uint32_t:4;      /* Reserved */
            } B;
        } PACR0;

        union {                 /* Peripheral Access Control Register 1 */
            uint32_t R;
            struct {
                uint32_t:4;      /* Reserved */
                uint32_t:4;      /* Reserved */
                uint32_t:4;      /* Reserved */
                uint32_t:4;      /* Reserved */
                uint32_t:4;      /* Reserved */
                uint32_t:4;      /* Reserved */
                uint32_t BW6:1;  /* SWT */
                uint32_t SP6:1;
                uint32_t WP6:1;
                uint32_t TP6:1;
                uint32_t BW7:1;  /* STM */
                uint32_t SP7:1;
                uint32_t WP7:1;
                uint32_t TP7:1;
            } B;
        } PACR1;

        union {                 /* Peripheral Access Control Register 2 */
            uint32_t R;
            struct {
                uint32_t BW0:1;  /* ECSM */
                uint32_t SP0:1;
                uint32_t WP0:1;
                uint32_t TP0:1;
                uint32_t BW1:1;  /* eDMA A */
                uint32_t SP1:1;
                uint32_t WP1:1;
                uint32_t TP1:1;
                uint32_t BW2:1;  /* INTC */
                uint32_t SP2:1;
                uint32_t WP2:1;
                uint32_t TP2:1;
                uint32_t:4;      /* Reserved */
                uint32_t:4;      /* Reserved */
                uint32_t BW5:1;  /* eDMA B */
                uint32_t SP5:1;
                uint32_t WP5:1;
                uint32_t TP5:1;
                uint32_t:4;      /* Reserved */
                uint32_t:4;      /* Reserved */
            } B;
        } PACR2;

