RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc567x.h
        uint32_t PBRIDGE_B_reserved002C[5];  /* 0x002C-0x003F */

        union {                 /* Off-Platform Peripheral Access Control Register 0 */
            uint32_t R;
            struct {
                uint32_t BW0:1;  /* eQADC A */
                uint32_t SP0:1;
                uint32_t WP0:1;
                uint32_t TP0:1;
                uint32_t BW1:1;  /* eQADC B */
                uint32_t SP1:1;
                uint32_t WP1:1;
                uint32_t TP1:1;
                uint32_t BW2:1;  /* Decimation Filters A, B, C, D */
                uint32_t SP2:1;
                uint32_t WP2:1;
                uint32_t TP2:1;
                uint32_t:4;      /* Reserved */
                uint32_t BW4:1;  /* DSPI_A */
                uint32_t SP4:1;
                uint32_t WP4:1;
                uint32_t TP4:1;
                uint32_t BW5:1;  /* DSPI_B */
                uint32_t SP5:1;
                uint32_t WP5:1;
                uint32_t TP5:1;
                uint32_t BW6:1;  /* DSPI_C */
                uint32_t SP6:1;
                uint32_t WP6:1;
                uint32_t TP6:1;
                uint32_t BW7:1;  /* DSPI_D */
                uint32_t SP7:1;
                uint32_t WP7:1;
                uint32_t TP7:1;
            } B;
        } OPACR0;

        union {                 /* Off-Platform Peripheral Access Control Register 1 */
            uint32_t R;
            struct {
                uint32_t:4;      /* Reserved */
                uint32_t:4;      /* Reserved */
                uint32_t:4;      /* Reserved */
                uint32_t:4;      /* Reserved */
                uint32_t BW4:1;  /* ESCI_A */
                uint32_t SP4:1;
                uint32_t WP4:1;
                uint32_t TP4:1;
                uint32_t BW5:1;  /* ESCI_B */
                uint32_t SP5:1;
                uint32_t WP5:1;
                uint32_t TP5:1;
                uint32_t BW6:1;  /* ESCI_C */
                uint32_t SP6:1;
                uint32_t WP6:1;
                uint32_t TP6:1;
                uint32_t:4;      /* Reserved */
            } B;
        } OPACR1;

        union {                 /* Off-Platform Peripheral Access Control Register 2 */
            uint32_t R;
            struct {
                uint32_t BW0:1;  /* FlexCAN_A */
                uint32_t SP0:1;
                uint32_t WP0:1;
                uint32_t TP0:1;
                uint32_t BW1:1;  /* FlexCAN_B */
                uint32_t SP1:1;
                uint32_t WP1:1;
                uint32_t TP1:1;
                uint32_t BW2:1;  /* FlexCAN_C */
                uint32_t SP2:1;
                uint32_t WP2:1;
                uint32_t TP2:1;
                uint32_t BW3:1;  /* FlexCAN_D */
                uint32_t SP3:1;
                uint32_t WP3:1;
                uint32_t TP3:1;
                uint32_t:4;      /* Reserved */
                uint32_t:4;      /* Reserved */
                uint32_t:4;      /* Reserved */
                uint32_t:4;      /* Reserved */
            } B;
        } OPACR2;

        union {                 /* Off-Platform Peripheral Access Control Register 3 */
            uint32_t R;
            struct {
                uint32_t BW0:1;  /* FlexRAY */
                uint32_t SP0:1;
                uint32_t WP0:1;
                uint32_t TP0:1;
                uint32_t:4;      /* Reserved */
                uint32_t:4;      /* Reserved */
                uint32_t BW3:1;  /* Temp Sensor */
                uint32_t SP3:1;
                uint32_t WP3:1;
                uint32_t TP3:1;
                uint32_t:4;      /* Reserved */
                uint32_t:4;      /* Reserved */
                uint32_t:4;      /* Reserved */
                uint32_t BW7:1;  /* BAM */
                uint32_t SP7:1;
                uint32_t WP7:1;
                uint32_t TP7:1;
            } B;
        } OPACR3;

        uint32_t PBRIDGE_B_reserved0050[4076];  /* 0x0050-0x3FFF */

    };

/****************************************************************************/
/*                     MODULE : FMPLL                                       */
/****************************************************************************/

    struct FMPLL_tag {

        uint32_t FMPLL_reserved0000;  /* 0x0000-0x0003 */

        union FMPLL_SYNSR_tag { /* FMPLL Synthesizer Status Register */
            uint32_t R;
            struct {
                uint32_t:22;
                uint32_t LOLF:1;
                uint32_t LOC:1;
                uint32_t MODE:1;
                uint32_t PLLSEL:1;
                uint32_t PLLREF:1;
                uint32_t LOCKS:1;
                uint32_t LOCK:1;
                uint32_t LOCF:1;
                uint32_t CALDONE:1;
                uint32_t CALPASS:1;
            } B;
        } SYNSR;

        union FMPLL_ESYNCR1_tag {/* FMPLL Enhanced Synthesizer Control Register 1 */
            uint32_t R;
            struct {
                uint32_t:1;
                uint32_t CLKCFG:3;
                uint32_t:8;
                uint32_t EPREDIV:4;
                uint32_t :8;
                uint32_t EMFD:8;
            } B;
        } ESYNCR1;

        union FMPLL_ESYNCR2_tag {/* FMPLL Enhanced Synthesizer Control Register 2 */
            uint32_t R;
            struct {
                uint32_t:8;
                uint32_t LOCEN:1;
                uint32_t LOLRE:1;
                uint32_t LOCRE:1;
                uint32_t LOLIRQ:1;
                uint32_t LOCIRQ:1;
                uint32_t:1;
                uint32_t ERATE:2;
                uint32_t CLKCFG_DIS:1;
                uint32_t:4;
                uint32_t EDEPTH:3;
                uint32_t:2;
                uint32_t ERFD:6;
            } B;
        } ESYNCR2;

        uint32_t FMPLL_reserved0010[4092];  /* 0x0010-0x3FFF */

    };

/****************************************************************************/
/*                     MODULE : External Bus Interface (EBI)                */
/****************************************************************************/

    struct EBI_CS_tag {
	    uint32_t ebi_cs_reserved [2];
    };
    
    struct EBI_CAL_CS_tag {
        union {                 /* Calibration Base Register Bank */
            uint32_t R;
            struct {
                uint32_t BA:17;
                uint32_t:3;
                uint32_t PS:1;
                uint32_t:3;
                uint32_t AD_MUX:1;
                uint32_t BL:1;
                uint32_t WEBS:1;
                uint32_t TBDIP:1;
                uint32_t:1;
                uint32_t SETA:1;
                uint32_t BI:1;
                uint32_t V:1;
            } B;
        } BR;

        union {                 /* Calibration Option Register Bank */
            uint32_t R;
            struct {
                uint32_t AM:17;
                uint32_t:7;
                uint32_t SCY:4;
                uint32_t:1;
                uint32_t BSCY:2;
                uint32_t:1;
            } B;
        } OR;
    };

    struct EBI_tag {

