RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc567x.h
        union EBI_MCR_tag {     /* Module Configuration Register */
            uint32_t R;
            struct {
                uint32_t:16;
                uint32_t ACGE:1;
                uint32_t:8;
                uint32_t MDIS:1;
                uint32_t:3;
                uint32_t D16_31:1;
                uint32_t AD_MUX:1;
                uint32_t DBM:1;
            } B;
        } MCR;

        uint32_t EBI_reserved0004;  /* 0x0004-0x0007 */

        union {                 /* Transfer Error Status Register */
            uint32_t R;
            struct {
                uint32_t:30;
                uint32_t TEAF:1;
                uint32_t BMTF:1;
            } B;
        } TESR;

        union {                 /* Bus Monitor Control Register */
            uint32_t R;
            struct {
                uint32_t:16;
                uint32_t BMT:8;
                uint32_t BME:1;
                  uint32_t:7;
            } B;
        } BMCR;

        /* Base/Option registers */
        struct EBI_CS_tag CS[4];

        uint32_t EBI_reserved0030[4];  /* 0x0030-0x003F */

        /* Calibration registers */
        struct EBI_CAL_CS_tag CAL_CS[4];

        uint32_t EBI_reserved0060[4000];  /* 0x0060-0x3FFF */

    };

/****************************************************************************/
/*                     MODULE : FLASH                                       */
/****************************************************************************/

    struct FLASH_tag {

        union {                 /* Module Configuration Register */
            uint32_t R;
            struct {
                uint32_t:5;
                uint32_t SIZE:3;
                uint32_t:1;
                uint32_t LAS:3;
                uint32_t:3;
                uint32_t MAS:1;
                uint32_t EER:1;
                uint32_t RWE:1;
                uint32_t SBC:1;
                uint32_t:1;
                uint32_t PEAS:1;
                uint32_t DONE:1;
                uint32_t PEG:1;
                uint32_t:4;
                uint32_t PGM:1;
                uint32_t PSUS:1;
                uint32_t ERS:1;
                uint32_t ESUS:1;
                uint32_t EHV:1;
            } B;
        } MCR;

        union LMLR_tag {        /* Low/Mid Address Space Block Locking Register */
            uint32_t R;
            struct {
                uint32_t LME:1;
                uint32_t:10;
                uint32_t SLOCK:1;
                uint32_t:2;
                uint32_t MLOCK:2;
                uint32_t:6;
                uint32_t LLOCK:10;
            } B;
        } LMLR; /* Legacy naming - refer to LML in Reference Manual */

        union HLR_tag {         /* High Address Space Block Locking Register */
            uint32_t R;
            struct {
                uint32_t HBE:1;
                uint32_t:25;
                uint32_t HBLOCK:6; /* Legacy naming - refer to HLOCK in Reference Manual */
            } B;
        } HLR; /* Legacy naming - refer to HBL in Reference Manual */

        union SLMLR_tag {       /* Secondary Low/Mid Block Locking Register */
            uint32_t R;
            struct {
                uint32_t SLE:1;
                uint32_t:10;
                uint32_t SSLOCK:1;
                uint32_t:2;
                uint32_t SMLOCK:2;
                uint32_t:6;
                uint32_t SLLOCK:10;
            } B;
        } SLMLR; /* Legacy naming - refer to SLL in Reference Manual */

        union {                 /* Low/Mid Address Space Block Select Register */
            uint32_t R;
            struct {
                uint32_t:14;
                uint32_t MSEL:2;
                uint32_t:6;
                uint32_t LSEL:10;
            } B;
        } LMSR; /* Legacy naming - refer to LMS in Reference Manual */

        union {                 /* High Address Space Block Select Register */
            uint32_t R;
            struct {
                uint32_t:26;
                uint32_t HBSEL:6; /* Legacy naming - refer to HSEL in Reference Manual */
            } B;
        } HSR; /* Legacy naming - refer to HBS in Reference Manual */

        union {                 /* Address Register */
            uint32_t R;
            struct {
                uint32_t SAD:1;
                uint32_t:13;
                uint32_t ADDR:15;
                uint32_t:3;
            } B;
        } AR; /* Legacy naming - refer to ADR in Reference Manual */

        union {                 /* Platform Flash Configuration Register 1 */
            uint32_t R;
            struct {
                uint32_t:7;
                uint32_t M8PFE:1;     /* z7 Nexus */
                uint32_t:1;           /* EBI Testing - Reserved */
                uint32_t M6PFE:1;     /* FlexRay  */
                uint32_t M5PFE:1;     /* eDMA_B   */
                uint32_t M4PFE:1;     /* eDMA_A   */
                uint32_t:1;           /* Reserved */
                uint32_t:1;           /* Reserved */
                uint32_t:1;           /* Reserved */
                uint32_t M0PFE:1;     /* z7 Core  */
                uint32_t APC:3;
                uint32_t WWSC:2;
                uint32_t RWSC:3;
                uint32_t:1;
                uint32_t DPFEN:1;
                uint32_t:1;
                uint32_t IPFEN:1;
                uint32_t:1;
                uint32_t PFLIM:2;
                uint32_t BFEN:1;
            } B;
        } BIUCR; /* Legacy naming - PFCR1 */

        union {                 /*Platform Flash Access Protection Register */
            uint32_t R;
            struct {
                uint32_t:14;
                uint32_t M8AP:2;     /* z7 Nexus */
                uint32_t:2;          /* EBI Testing - Reserved */
                uint32_t M6AP:2;     /* FlexRay  */
                uint32_t M5AP:2;     /* eDMA_B   */
                uint32_t M4AP:2;     /* eDMA_A   */
                uint32_t:2;          /* Reserved */
                uint32_t:2;          /* Reserved */
                uint32_t:2;          /* Reserved */
                uint32_t M0AP:2;     /* z7 Core  */
            } B;
        } BIUAPR; /* Legacy naming - refer to PFAPR in Reference Manual */

        union {                 /* Platform Flash Configuration Register 2 */
            uint32_t R;
            struct {
                uint32_t LBCFG:2;
                uint32_t:30;
            } B;
        } BIUCR2;

