RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc567x.h
        union {                 /* External IRQ Input Select Register */
            uint32_t R;
            struct {
                uint32_t ESEL15:2;
                uint32_t ESEL14:2;
                uint32_t ESEL13:2;
                uint32_t ESEL12:2;
                uint32_t ESEL11:2;
                uint32_t ESEL10:2;
                uint32_t ESEL9:2;
                uint32_t ESEL8:2;
                uint32_t ESEL7:2;
                uint32_t ESEL6:2;
                uint32_t ESEL5:2;
                uint32_t ESEL4:2;
                uint32_t ESEL3:2;
                uint32_t ESEL2:2;
                uint32_t ESEL1:2;
                uint32_t ESEL0:2;
            } B;
        } EIISR;

        union {                 /* DSPI Input Select Register */
            uint32_t R;
            struct {
                uint32_t SINSELA:2;
                uint32_t SSSELA:2;
                uint32_t SCKSELA:2;
                uint32_t TRIGSELA:2;
                uint32_t SINSELB:2;
                uint32_t SSSELB:2;
                uint32_t SCKSELB:2;
                uint32_t TRIGSELB:2;
                uint32_t SINSELC:2;
                uint32_t SSSELC:2;
                uint32_t SCKSELC:2;
                uint32_t TRIGSELC:2;
                uint32_t SINSELD:2;
                uint32_t SSSELD:2;
                uint32_t SCKSELD:2;
                uint32_t TRIGSELD:2;
            } B;
        } DISR;

        int32_t SIU_reserved090C;  /* 0x090C-0x090F */

        union {                 /* eQADC Command FIFO Trigger Source Select - IMUX Select Registers */
            uint32_t R;
            struct {
                uint32_t:1;
                uint32_t CTSEL5_0:7;
                uint32_t:1;
                uint32_t CTSEL4_0:7;
                uint32_t:1;
                uint32_t CTSEL3_0:7;
                uint32_t:1;
                uint32_t CTSEL2_0:7;
            } B;
        } ISEL4;

        union {                 /* eQADC Command FIFO Trigger Source Select - IMUX Select Registers */
            uint32_t R;
            struct {
                uint32_t:1;
                uint32_t CTSEL1_0:7;
                uint32_t:1;
                uint32_t CTSEL0_0:7;
                uint32_t:16;
            } B;
        } ISEL5;

        union {                 /* eQADC Command FIFO Trigger Source Select - IMUX Select Registers */
            uint32_t R;
            struct {
                uint32_t:1;
                uint32_t CTSEL5_1:7;
                uint32_t:1;
                uint32_t CTSEL4_1:7;
                uint32_t:1;
                uint32_t CTSEL3_1:7;
                uint32_t:1;
                uint32_t CTSEL2_1:7;
            } B;
        } ISEL6;

        union {                 /* eQADC Command FIFO Trigger Source Select - IMUX Select Registers */
            uint32_t R;
            struct {
                uint32_t:1;
                uint32_t CTSEL1_1:7;
                uint32_t:1;
                uint32_t CTSEL0_1:7;
                uint32_t:16;
            } B;
        } ISEL7;

        union {                 /* eTPU Input Select Register */
            uint32_t R;
            struct {
                uint32_t:11;
                uint32_t ETPU29:1;
                uint32_t:3;
                uint32_t ETPU28:1;
                uint32_t:3;
                uint32_t ETPU27:1;
                uint32_t:3;
                uint32_t ETPU26:1;
                uint32_t:3;
                uint32_t ETPU25:1;
                uint32_t:3;
                uint32_t ETPU24:1;
             } B;
        } ISEL8;

        union {                 /* eQADC Advanced Trigger Select  */
            uint32_t R;
            struct {
                uint32_t:27;
                uint32_t ETSEL0A:5;
            } B;
        } ISEL9;

        union {                 /* DecFilter Integrator Control  */
            uint32_t R;
            struct {
                uint32_t ZSELA:4;
                uint32_t HSELA:4;
                uint32_t ZSELB:4;
                uint32_t HSELB:4;
                uint32_t ZSELC:4;
                uint32_t HSELC:4;
                uint32_t ZSELD:4;
                uint32_t HSELD:4;
            } B;
        } DECFIL1;

        union {                 /* DecFilter Integrator Control */
            uint32_t R;
            struct {
                uint32_t ZSELE:4;
                uint32_t HSELE:4;
                uint32_t ZSELF:4;
                uint32_t HSELF:4;
                uint32_t ZSELG:4;
                uint32_t HSELG:4;
                uint32_t ZSELH:4;
                uint32_t HSELH:4;
            } B;
        } DECFIL2;


        int32_t SIU_reserved0920[20]; /* 0x0930-0x097F */

        union {                 /* Chip Configuration Register Register */
            uint32_t R;
            struct {
                uint32_t:14;
                uint32_t MATCH:1;
                uint32_t DISNEX:1;
                uint32_t:16;
            } B;
        } CCR;

        union {                 /* External Clock Configuration Register Register */
            uint32_t R;
            struct {
                uint32_t:16;
                uint32_t ENGDIV:8;
                uint32_t ECSS:1;
                uint32_t:3;
                uint32_t EBTS:1;
                uint32_t:1;
                uint32_t EBDF:2;
            } B;
        } ECCR;

        union {                 /* Compare A Register High */
            uint32_t R;
            struct {
                uint32_t CMPAH:32;
            } B;
        } CARH;

        union {                 /* Compare A Register Low */
            uint32_t R;
            struct {
                uint32_t CMPAL:32;
            } B;
        } CARL;

        union {                 /* Compare B Register High */
            uint32_t R;
            struct {
                uint32_t CMPBH:32;
            } B;
        } CBRH;

        union {                 /* Compare B Register Low */
            uint32_t R;
            struct {
                uint32_t CMPBL:32;
            } B;
        } CBRL;

        int32_t SIU_reserved0998[2];  /* 0x0998-0x099F */

        union {                 /* System Clock Register */
            uint32_t R;
            struct {
                uint32_t:22;
                uint32_t IPCLKDIV:2;
                uint32_t:3;
                uint32_t BYPASS:1;
                uint32_t SYSCLKDIV:2;
                uint32_t:2;
            } B;
        } SYSDIV;

        union {                 /* Halt Register */
            uint32_t R;
            struct {
                uint32_t CPUSTP:1;     /* CPU and Platform stop request  */
                uint32_t:4;            /* Reserved */
                uint32_t TPUSTP:1;     /* eTPU_A stop request */
                uint32_t NPCSTP:1;     /* Nexus stop request */
                uint32_t EBISTP:1;     /* EBI stop request*/
                uint32_t ADCSTP:1;     /* eQADC stop request */
                uint32_t:1;            /* Reserved */
                uint32_t MIOSSTP:1;    /* eMIOS stop request */
                uint32_t DFILSTP:1;    /* Decimation filter stop request */
                uint32_t:1;            /* Reserved */
                uint32_t PITSTP:1;     /* PIT stop request */
                uint32_t:2;            /* Reserved */
                uint32_t CNDSTP:1;     /* FlexCAN D stop request */
                uint32_t CNCSTP:1;     /* FlexCAN C stop request */
                uint32_t CNBSTP:1;     /* FlexCAN B stop request */
                uint32_t CNASTP:1;     /* FlexCAN A stop request */
                uint32_t SPIDSTP:1;    /* DSPI D stop request */
                uint32_t SPICSTP:1;    /* DSPI C stop request */
                uint32_t SPIBSTP:1;    /* DSPI B stop request */
                uint32_t SPIASTP:1;    /* DSPI C stop request */
                uint32_t:5;            /* Reserved */
				uint32_t SCICSTP:1;    /* eSCI C stop request */
                uint32_t SCIBSTP:1;    /* eSCI B stop request */
                uint32_t SCIASTP:1;    /* eSCI A stop request */
            } B;
        } HLT;

        union {                 /* Halt Acknowledge Register */
            uint32_t R;
            struct {
                uint32_t CPUACK:1;     /* CPU and Platform stop acknowledge  */
                uint32_t:4;            /* Reserved */
                uint32_t TPUACK:1;     /* eTPU_A stop acknowledge */
                uint32_t NPCACK:1;     /* Nexus stop acknowledge */
                uint32_t EBIACK:1;     /* EBI stop acknowledge*/
                uint32_t ADCACK:1;     /* eQADC stop acknowledge */
                uint32_t:1;            /* Reserved */
                uint32_t MIOSACK:1;    /* eMIOS stop acknowledge */
                uint32_t DFILACK:1;    /* Decimation filter stop acknowledge */
                uint32_t:1;            /* Reserved */
                uint32_t PITACK:1;     /* PIT stop acknowledge */
                uint32_t:2;            /* Reserved */
                uint32_t CNDACK:1;     /* FlexCAN D stop acknowledge */
                uint32_t CNCACK:1;     /* FlexCAN C stop acknowledge */
                uint32_t CNBACK:1;     /* FlexCAN B stop acknowledge */
                uint32_t CNAACK:1;     /* FlexCAN A stop acknowledge */
                uint32_t SPIDACK:1;    /* DSPI D stop acknowledge */
                uint32_t SPICACK:1;    /* DSPI C stop acknowledge */
                uint32_t SPIBACK:1;    /* DSPI B stop acknowledge */
                uint32_t SPIAACK:1;    /* DSPI C stop acknowledge */
                uint32_t:5;            /* Reserved */
				uint32_t SCICACK:1;    /* eSCI C stop acknowledge */
                uint32_t SCIBACK:1;    /* eSCI B stop acknowledge */
                uint32_t SCIAACK:1;    /* eSCI A stop acknowledge */
            } B;
        } HLTACK;

        int32_t SIU_reserved09AC[21]; /* 0x09AC-0x09FF */

        int32_t SIU_reserved0A00[128]; /* 0x0A00-0x0BFF */

