RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc567x.h
        union {               /* Parallel GPIO Pin Data Output Register */
            uint32_t R;
            struct {
                uint32_t PGPDO0:1;
                uint32_t PGPDO1:1;
                uint32_t PGPDO2:1;
                uint32_t PGPDO3:1;
                uint32_t PGPDO4:1;
                uint32_t PGPDO5:1;
                uint32_t PGPDO6:1;
                uint32_t PGPDO7:1;
                uint32_t PGPDO8:1;
                uint32_t PGPDO9:1;
                uint32_t PGPDO10:1;
                uint32_t PGPDO11:1;
                uint32_t PGPDO12:1;
                uint32_t PGPDO13:1;
                uint32_t PGPDO14:1;
                uint32_t PGPDO15:1;
                uint32_t PGPDO16:1;
                uint32_t PGPDO17:1;
                uint32_t PGPDO18:1;
                uint32_t PGPDO19:1;
                uint32_t PGPDO20:1;
                uint32_t PGPDO21:1;
                uint32_t PGPDO22:1;
                uint32_t PGPDO23:1;
                uint32_t PGPDO24:1;
                uint32_t PGPDO25:1;
                uint32_t PGPDO26:1;
                uint32_t PGPDO27:1;
                uint32_t PGPDO28:1;
                uint32_t PGPDO29:1;
                uint32_t PGPDO30:1;
                uint32_t PGPDO31:1;
            } B;
        } PGPDO[16];

        union {               /* Parallel GPIO Pin Data Input Register */
            uint32_t R;
            struct {
                uint32_t PGPDI0:1;
                uint32_t PGPDI1:1;
                uint32_t PGPDI2:1;
                uint32_t PGPDI3:1;
                uint32_t PGPDI4:1;
                uint32_t PGPDI5:1;
                uint32_t PGPDI6:1;
                uint32_t PGPDI7:1;
                uint32_t PGPDI8:1;
                uint32_t PGPDI9:1;
                uint32_t PGPDI10:1;
                uint32_t PGPDI11:1;
                uint32_t PGPDI12:1;
                uint32_t PGPDI13:1;
                uint32_t PGPDI14:1;
                uint32_t PGPDI15:1;
                uint32_t PGPDI16:1;
                uint32_t PGPDI17:1;
                uint32_t PGPDI18:1;
                uint32_t PGPDI19:1;
                uint32_t PGPDI20:1;
                uint32_t PGPDI21:1;
                uint32_t PGPDI22:1;
                uint32_t PGPDI23:1;
                uint32_t PGPDI24:1;
                uint32_t PGPDI25:1;
                uint32_t PGPDI26:1;
                uint32_t PGPDI27:1;
                uint32_t PGPDI28:1;
                uint32_t PGPDI29:1;
                uint32_t PGPDI30:1;
                uint32_t PGPDI31:1;
            } B;
        } PGPDI[16];

        union {              /* Masked Parallel GPIO Pin Data Input Register */
            uint32_t R;
            struct {
                uint32_t MASK0:1;
                uint32_t MASK1:1;
                uint32_t MASK2:1;
                uint32_t MASK3:1;
                uint32_t MASK4:1;
                uint32_t MASK5:1;
                uint32_t MASK6:1;
                uint32_t MASK7:1;
                uint32_t MASK8:1;
                uint32_t MASK9:1;
                uint32_t MASK10:1;
                uint32_t MASK11:1;
                uint32_t MASK12:1;
                uint32_t MASK13:1;
                uint32_t MASK14:1;
                uint32_t MASK15:1;
                uint32_t DATA0:1;
                uint32_t DATA1:1;
                uint32_t DATA2:1;
                uint32_t DATA3:1;
                uint32_t DATA4:1;
                uint32_t DATA5:1;
                uint32_t DATA6:1;
                uint32_t DATA7:1;
                uint32_t DATA8:1;
                uint32_t DATA9:1;
                uint32_t DATA10:1;
                uint32_t DATA11:1;
                uint32_t DATA12:1;
                uint32_t DATA13:1;
                uint32_t DATA14:1;
                uint32_t DATA15:1;
            } B;
        } MPGPDO[32];

        union {              /* DSPI_A Mask Output High Register */
            uint32_t R;
            struct {
                uint32_t MASK0:1;
                uint32_t MASK1:1;
                uint32_t MASK2:1;
                uint32_t MASK3:1;
                uint32_t MASK4:1;
                uint32_t MASK5:1;
                uint32_t MASK6:1;
                uint32_t MASK7:1;
                uint32_t MASK8:1;
                uint32_t MASK9:1;
                uint32_t MASK10:1;
                uint32_t MASK11:1;
                uint32_t MASK12:1;
                uint32_t MASK13:1;
                uint32_t MASK14:1;
                uint32_t MASK15:1;
                uint32_t DATA0:1;
                uint32_t DATA1:1;
                uint32_t DATA2:1;
                uint32_t DATA3:1;
                uint32_t DATA4:1;
                uint32_t DATA5:1;
                uint32_t DATA6:1;
                uint32_t DATA7:1;
                uint32_t DATA8:1;
                uint32_t DATA9:1;
                uint32_t DATA10:1;
                uint32_t DATA11:1;
                uint32_t DATA12:1;
                uint32_t DATA13:1;
                uint32_t DATA14:1;
                uint32_t DATA15:1;
            } B;
        } DSPIAH;

        union {              /* DSPI_A Mask Output Low Register */
            uint32_t R;
            struct {
                uint32_t MASK16:1;
                uint32_t MASK17:1;
                uint32_t MASK18:1;
                uint32_t MASK19:1;
                uint32_t MASK20:1;
                uint32_t MASK21:1;
                uint32_t MASK22:1;
                uint32_t MASK23:1;
                uint32_t MASK24:1;
                uint32_t MASK25:1;
                uint32_t MASK26:1;
                uint32_t MASK27:1;
                uint32_t MASK28:1;
                uint32_t MASK29:1;
                uint32_t MASK30:1;
                uint32_t MASK31:1;
                uint32_t DATA16:1;
                uint32_t DATA17:1;
                uint32_t DATA18:1;
                uint32_t DATA19:1;
                uint32_t DATA20:1;
                uint32_t DATA21:1;
                uint32_t DATA22:1;
                uint32_t DATA23:1;
                uint32_t DATA24:1;
                uint32_t DATA25:1;
                uint32_t DATA26:1;
                uint32_t DATA27:1;
                uint32_t DATA28:1;
                uint32_t DATA29:1;
                uint32_t DATA30:1;
                uint32_t DATA31:1;
            } B;
        } DSPIAL;

        union {              /* DSPI_B Mask Output High Register */
            uint32_t R;
            struct {
                uint32_t MASK0:1;
                uint32_t MASK1:1;
                uint32_t MASK2:1;
                uint32_t MASK3:1;
                uint32_t MASK4:1;
                uint32_t MASK5:1;
                uint32_t MASK6:1;
                uint32_t MASK7:1;
                uint32_t MASK8:1;
                uint32_t MASK9:1;
                uint32_t MASK10:1;
                uint32_t MASK11:1;
                uint32_t MASK12:1;
                uint32_t MASK13:1;
                uint32_t MASK14:1;
                uint32_t MASK15:1;
                uint32_t DATA0:1;
                uint32_t DATA1:1;
                uint32_t DATA2:1;
                uint32_t DATA3:1;
                uint32_t DATA4:1;
                uint32_t DATA5:1;
                uint32_t DATA6:1;
                uint32_t DATA7:1;
                uint32_t DATA8:1;
                uint32_t DATA9:1;
                uint32_t DATA10:1;
                uint32_t DATA11:1;
                uint32_t DATA12:1;
                uint32_t DATA13:1;
                uint32_t DATA14:1;
                uint32_t DATA15:1;
            } B;
        } DSPIBH;

