RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc567x.h
        union {              /* DSPI_B Mask Output Low Register */
            uint32_t R;
            struct {
                uint32_t MASK16:1;
                uint32_t MASK17:1;
                uint32_t MASK18:1;
                uint32_t MASK19:1;
                uint32_t MASK20:1;
                uint32_t MASK21:1;
                uint32_t MASK22:1;
                uint32_t MASK23:1;
                uint32_t MASK24:1;
                uint32_t MASK25:1;
                uint32_t MASK26:1;
                uint32_t MASK27:1;
                uint32_t MASK28:1;
                uint32_t MASK29:1;
                uint32_t MASK30:1;
                uint32_t MASK31:1;
                uint32_t DATA16:1;
                uint32_t DATA17:1;
                uint32_t DATA18:1;
                uint32_t DATA19:1;
                uint32_t DATA20:1;
                uint32_t DATA21:1;
                uint32_t DATA22:1;
                uint32_t DATA23:1;
                uint32_t DATA24:1;
                uint32_t DATA25:1;
                uint32_t DATA26:1;
                uint32_t DATA27:1;
                uint32_t DATA28:1;
                uint32_t DATA29:1;
                uint32_t DATA30:1;
                uint32_t DATA31:1;
            } B;
        } DSPIBL;

        union {              /* DSPI_C Mask Output High Register */
            uint32_t R;
            struct {
                uint32_t MASK0:1;
                uint32_t MASK1:1;
                uint32_t MASK2:1;
                uint32_t MASK3:1;
                uint32_t MASK4:1;
                uint32_t MASK5:1;
                uint32_t MASK6:1;
                uint32_t MASK7:1;
                uint32_t MASK8:1;
                uint32_t MASK9:1;
                uint32_t MASK10:1;
                uint32_t MASK11:1;
                uint32_t MASK12:1;
                uint32_t MASK13:1;
                uint32_t MASK14:1;
                uint32_t MASK15:1;
                uint32_t DATA0:1;
                uint32_t DATA1:1;
                uint32_t DATA2:1;
                uint32_t DATA3:1;
                uint32_t DATA4:1;
                uint32_t DATA5:1;
                uint32_t DATA6:1;
                uint32_t DATA7:1;
                uint32_t DATA8:1;
                uint32_t DATA9:1;
                uint32_t DATA10:1;
                uint32_t DATA11:1;
                uint32_t DATA12:1;
                uint32_t DATA13:1;
                uint32_t DATA14:1;
                uint32_t DATA15:1;
            } B;
        } DSPICH;

        union {              /* DSPI_C Mask Output Low Register */
            uint32_t R;
            struct {
                uint32_t MASK16:1;
                uint32_t MASK17:1;
                uint32_t MASK18:1;
                uint32_t MASK19:1;
                uint32_t MASK20:1;
                uint32_t MASK21:1;
                uint32_t MASK22:1;
                uint32_t MASK23:1;
                uint32_t MASK24:1;
                uint32_t MASK25:1;
                uint32_t MASK26:1;
                uint32_t MASK27:1;
                uint32_t MASK28:1;
                uint32_t MASK29:1;
                uint32_t MASK30:1;
                uint32_t MASK31:1;
                uint32_t DATA16:1;
                uint32_t DATA17:1;
                uint32_t DATA18:1;
                uint32_t DATA19:1;
                uint32_t DATA20:1;
                uint32_t DATA21:1;
                uint32_t DATA22:1;
                uint32_t DATA23:1;
                uint32_t DATA24:1;
                uint32_t DATA25:1;
                uint32_t DATA26:1;
                uint32_t DATA27:1;
                uint32_t DATA28:1;
                uint32_t DATA29:1;
                uint32_t DATA30:1;
                uint32_t DATA31:1;
            } B;
        } DSPICL;

        union {              /* DSPI_D Mask Output High Register */
            uint32_t R;
            struct {
                uint32_t MASK0:1;
                uint32_t MASK1:1;
                uint32_t MASK2:1;
                uint32_t MASK3:1;
                uint32_t MASK4:1;
                uint32_t MASK5:1;
                uint32_t MASK6:1;
                uint32_t MASK7:1;
                uint32_t MASK8:1;
                uint32_t MASK9:1;
                uint32_t MASK10:1;
                uint32_t MASK11:1;
                uint32_t MASK12:1;
                uint32_t MASK13:1;
                uint32_t MASK14:1;
                uint32_t MASK15:1;
                uint32_t DATA0:1;
                uint32_t DATA1:1;
                uint32_t DATA2:1;
                uint32_t DATA3:1;
                uint32_t DATA4:1;
                uint32_t DATA5:1;
                uint32_t DATA6:1;
                uint32_t DATA7:1;
                uint32_t DATA8:1;
                uint32_t DATA9:1;
                uint32_t DATA10:1;
                uint32_t DATA11:1;
                uint32_t DATA12:1;
                uint32_t DATA13:1;
                uint32_t DATA14:1;
                uint32_t DATA15:1;
            } B;
        } DSPIDH;

        union {              /* DSPI_D Mask Output Low Register */
            uint32_t R;
            struct {
                uint32_t MASK16:1;
                uint32_t MASK17:1;
                uint32_t MASK18:1;
                uint32_t MASK19:1;
                uint32_t MASK20:1;
                uint32_t MASK21:1;
                uint32_t MASK22:1;
                uint32_t MASK23:1;
                uint32_t MASK24:1;
                uint32_t MASK25:1;
                uint32_t MASK26:1;
                uint32_t MASK27:1;
                uint32_t MASK28:1;
                uint32_t MASK29:1;
                uint32_t MASK30:1;
                uint32_t MASK31:1;
                uint32_t DATA16:1;
                uint32_t DATA17:1;
                uint32_t DATA18:1;
                uint32_t DATA19:1;
                uint32_t DATA20:1;
                uint32_t DATA21:1;
                uint32_t DATA22:1;
                uint32_t DATA23:1;
                uint32_t DATA24:1;
                uint32_t DATA25:1;
                uint32_t DATA26:1;
                uint32_t DATA27:1;
                uint32_t DATA28:1;
                uint32_t DATA29:1;
                uint32_t DATA30:1;
                uint32_t DATA31:1;
            } B;
        } DSPIDL;

