RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc567x.h
        int32_t SIU_reserved0D20[8];  /* 0x0D20-0x0D3F */

        union {               /* ETPU B Select Register */
            uint32_t R;
            struct {
                uint32_t ETPUB15:1;
                uint32_t ETPUB14:1;
                uint32_t ETPUB13:1;
                uint32_t ETPUB12:1;
                uint32_t ETPUB11:1;
                uint32_t ETPUB10:1;
                uint32_t ETPUB9:1;
                uint32_t ETPUB8:1;
                uint32_t ETPUB7:1;
                uint32_t ETPUB6:1;
                uint32_t ETPUB5:1;
                uint32_t ETPUB4:1;
                uint32_t ETPUB3:1;
                uint32_t ETPUB2:1;
                uint32_t ETPUB1:1;
                uint32_t ETPUB0:1;
                uint32_t ETPUB31:1;
                uint32_t ETPUB30:1;
                uint32_t ETPUB29:1;
                uint32_t ETPUB28:1;
                uint32_t ETPUB27:1;
                uint32_t ETPUB26:1;
                uint32_t ETPUB25:1;
                uint32_t ETPUB24:1;
                uint32_t ETPUB23:1;
                uint32_t ETPUB22:1;
                uint32_t ETPUB21:1;
                uint32_t ETPUB20:1;
                uint32_t ETPUB19:1;
                uint32_t ETPUB18:1;
                uint32_t ETPUB17:1;
                uint32_t ETPUB16:1;
            } B ;
        } ETPUBA;

        union {               /* EMIOS A Select Register */
            uint32_t R;
            struct {
                uint32_t EMIOS7:1;
                uint32_t EMIOS6:1;
                uint32_t EMIOS5:1;
                uint32_t EMIOS4:1;
                uint32_t EMIOS3:1;
                uint32_t EMIOS2:1;
                uint32_t EMIOS1:1;
                uint32_t EMIOS0:1;
                uint32_t EMIOS8:1;
                uint32_t EMIOS9:1;
                uint32_t EMIOS10:1;
                uint32_t EMIOS11:1;
                uint32_t EMIOS12:1;
                uint32_t EMIOS13:1;
                uint32_t EMIOS14:1;
                uint32_t EMIOS15:1;
                uint32_t EMIOS16:1;
                uint32_t EMIOS17:1;
                uint32_t EMIOS18:1;
                uint32_t EMIOS19:1;
                uint32_t EMIOS20:1;
                uint32_t EMIOS21:1;
                uint32_t EMIOS22:1;
                uint32_t EMIOS23:1;
                uint32_t EMIOS0_0:1;
                uint32_t EMIOS1_1:1;
                uint32_t EMIOS2_2:1;
                uint32_t EMIOS3_3:1;
                uint32_t EMIOS4_4:1;
                uint32_t EMIOS5_5:1;
                uint32_t EMIOS6_6:1;
                uint32_t EMIOS7_7:1;
            } B;
        } EMIOSA;

        union {             /* DSPIAH/L Select Register for DSPI A */
            uint32_t R;
            struct {
                uint32_t DSPIAH0:1;
                uint32_t DSPIAH1:1;
                uint32_t DSPIAH2:1;
                uint32_t DSPIAH3:1;
                uint32_t DSPIAH4:1;
                uint32_t DSPIAH5:1;
                uint32_t DSPIAH6:1;
                uint32_t DSPIAH7:1;
                uint32_t DSPIAH8:1;
                uint32_t DSPIAH9:1;
                uint32_t DSPIAH10:1;
                uint32_t DSPIAH11:1;
                uint32_t DSPIAH12:1;
                uint32_t DSPIAH13:1;
                uint32_t DSPIAH14:1;
                uint32_t DSPIAH15:1;
                uint32_t DSPIAL16:1;
                uint32_t DSPIAL17:1;
                uint32_t DSPIAL18:1;
                uint32_t DSPIAL19:1;
                uint32_t DSPIAL20:1;
                uint32_t DSPIAL21:1;
                uint32_t DSPIAL22:1;
                uint32_t DSPIAL23:1;
                uint32_t DSPIAL24:1;
                uint32_t DSPIAL25:1;
                uint32_t DSPIAL26:1;
                uint32_t DSPIAL27:1;
                uint32_t DSPIAL28:1;
                uint32_t DSPIAL29:1;
                uint32_t DSPIAL30:1;
                uint32_t DSPIAL31:1;
            } B;
        } DSPIAHLA;

        int32_t SIU_reserved0D4C;  /* 0x0D4C-0x0D4F */

        union {               /* ETPU A Select Register */
            uint32_t R;
            struct {
                uint32_t ETPUA23:1;
                uint32_t ETPUA22:1;
                uint32_t ETPUA21:1;
                uint32_t ETPUA20:1;
                uint32_t ETPUA19:1;
                uint32_t ETPUA18:1;
                uint32_t ETPUA17:1;
                uint32_t ETPUA16:1;
                uint32_t ETPUA29:1;
                uint32_t ETPUA28:1;
                uint32_t ETPUA27:1;
                uint32_t ETPUA26:1;
                uint32_t ETPUA25:1;
                uint32_t ETPUA24:1;
                uint32_t ETPUA31:1;
                uint32_t ETPUA30:1;
                uint32_t ETPUA12:1;
                uint32_t ETPUA13:1;
                uint32_t ETPUA14:1;
                uint32_t ETPUA15:1;
                uint32_t ETPUA0:1;
                uint32_t ETPUA1:1;
                uint32_t ETPUA2:1;
                uint32_t ETPUA3:1;
                uint32_t ETPUA4:1;
                uint32_t ETPUA5:1;
                uint32_t ETPUA6:1;
                uint32_t ETPUA7:1;
                uint32_t ETPUA8:1;
                uint32_t ETPUA9:1;
                uint32_t ETPUA10:1;
                uint32_t ETPUA11:1;
            } B ;
        } ETPUAB;

        union {               /* EMIOS B Select Register */
            uint32_t R;
            struct {
                uint32_t EMIOS11:1;
                uint32_t EMIOS10:1;
                uint32_t EMIOS9:1;
                uint32_t EMIOS8:1;
                uint32_t EMIOS6:1;
                uint32_t EMIOS5:1;
                uint32_t EMIOS4:1;
                uint32_t EMIOS3:1;
                uint32_t EMIOS2:1;
                uint32_t EMIOS1:1;
                uint32_t EMIOS0:1;
                uint32_t EMIOS23:1;
                uint32_t EMIOS15:1;
                uint32_t EMIOS14:1;
                uint32_t EMIOS13:1;
                uint32_t EMIOS12:1;
                uint32_t EMIOS23_23:1;
                uint32_t EMIOS15_15:1;
                uint32_t EMIOS14_14:1;
                uint32_t EMIOS13_13:1;
                uint32_t EMIOS12_12:1;
                uint32_t EMIOS11_11:1;
                uint32_t EMIOS10_10:1;
                uint32_t EMIOS9_9:1;
                uint32_t EMIOS8_8:1;
                uint32_t EMIOS6_6:1;
                uint32_t EMIOS5_5:1;
                uint32_t EMIOS4_4:1;
                uint32_t EMIOS3_3:1;
                uint32_t EMIOS2_2:1;
                uint32_t EMIOS1_1:1;
                uint32_t EMIOS0_0:1;
            } B;
        } EMIOSB;

        union {             /* DSPIBH/L Select Register for DSPI B */
            uint32_t R;
            struct {
                uint32_t DSPIBH0:1;
                uint32_t DSPIBH1:1;
                uint32_t DSPIBH2:1;
                uint32_t DSPIBH3:1;
                uint32_t DSPIBH4:1;
                uint32_t DSPIBH5:1;
                uint32_t DSPIBH6:1;
                uint32_t DSPIBH7:1;
                uint32_t DSPIBH8:1;
                uint32_t DSPIBH9:1;
                uint32_t DSPIBH10:1;
                uint32_t DSPIBH11:1;
                uint32_t DSPIBH12:1;
                uint32_t DSPIBH13:1;
                uint32_t DSPIBH14:1;
                uint32_t DSPIBH15:1;
                uint32_t DSPIBL16:1;
                uint32_t DSPIBL17:1;
                uint32_t DSPIBL18:1;
                uint32_t DSPIBL19:1;
                uint32_t DSPIBL20:1;
                uint32_t DSPIBL21:1;
                uint32_t DSPIBL22:1;
                uint32_t DSPIBL23:1;
                uint32_t DSPIBL24:1;
                uint32_t DSPIBL25:1;
                uint32_t DSPIBL26:1;
                uint32_t DSPIBL27:1;
                uint32_t DSPIBL28:1;
                uint32_t DSPIBL29:1;
                uint32_t DSPIBL30:1;
                uint32_t DSPIBL31:1;
            } B;
        } DSPIBHLB;

        int32_t SIU_reserved0D5C;  /* 0x0D5C-0x0D5F */

