RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc567x.h
        union {               /* ETPU A Select Register */
            uint32_t R;
            struct {
                uint32_t ETPUA12:1;
                uint32_t ETPUA13:1;
                uint32_t ETPUA14:1;
                uint32_t ETPUA15:1;
                uint32_t ETPUA0:1;
                uint32_t ETPUA1:1;
                uint32_t ETPUA2:1;
                uint32_t ETPUA3:1;
                uint32_t ETPUA4:1;
                uint32_t ETPUA5:1;
                uint32_t ETPUA6:1;
                uint32_t ETPUA7:1;
                uint32_t ETPUA8:1;
                uint32_t ETPUA9:1;
                uint32_t ETPUA10:1;
                uint32_t ETPUA11:1;
                uint32_t ETPUA23:1;
                uint32_t ETPUA22:1;
                uint32_t ETPUA21:1;
                uint32_t ETPUA20:1;
                uint32_t ETPUA19:1;
                uint32_t ETPUA18:1;
                uint32_t ETPUA17:1;
                uint32_t ETPUA16:1;
                uint32_t ETPUA29:1;
                uint32_t ETPUA28:1;
                uint32_t ETPUA27:1;
                uint32_t ETPUA26:1;
                uint32_t ETPUA25:1;
                uint32_t ETPUA24:1;
                uint32_t ETPUA31:1;
                uint32_t ETPUA30:1;
            } B ;
        } ETPUAC;

        union {               /* EMIOS C Select Register */
            uint32_t R;
            struct {
                uint32_t EMIOS12:1;
                uint32_t EMIOS13:1;
                uint32_t EMIOS14:1;
                uint32_t EMIOS15:1;
                uint32_t EMIOS23:1;
                uint32_t EMIOS0:1;
                uint32_t EMIOS1:1;
                uint32_t EMIOS2:1;
                uint32_t EMIOS3:1;
                uint32_t EMIOS4:1;
                uint32_t EMIOS5:1;
                uint32_t EMIOS6:1;
                uint32_t EMIOS8:1;
                uint32_t EMIOS9:1;
                uint32_t EMIOS10:1;
                uint32_t EMIOS11:1;
                uint32_t EMIOS23_23:1;
                uint32_t EMIOS22:1;
                uint32_t EMIOS21:1;
                uint32_t EMIOS20:1;
                uint32_t EMIOS19:1;
                uint32_t EMIOS18:1;
                uint32_t EMIOS17:1;
                uint32_t EMIOS16:1;
                uint32_t EMIOS29:1;
                uint32_t EMIOS28:1;
                uint32_t EMIOS27:1;
                uint32_t EMIOS26:1;
                uint32_t EMIOS25:1;
                uint32_t EMIOS24:1;
                uint32_t EMIOS31:1;
                uint32_t EMIOS30:1;
            } B;
        } EMIOSC;

        union {             /* DSPICH/L Select Register for DSPI C */
            uint32_t R;
            struct {
                uint32_t DSPICH0:1;
                uint32_t DSPICH1:1;
                uint32_t DSPICH2:1;
                uint32_t DSPICH3:1;
                uint32_t DSPICH4:1;
                uint32_t DSPICH5:1;
                uint32_t DSPICH6:1;
                uint32_t DSPICH7:1;
                uint32_t DSPICH8:1;
                uint32_t DSPICH9:1;
                uint32_t DSPICH10:1;
                uint32_t DSPICH11:1;
                uint32_t DSPICH12:1;
                uint32_t DSPICH13:1;
                uint32_t DSPICH14:1;
                uint32_t DSPICH15:1;
                uint32_t DSPICL16:1;
                uint32_t DSPICL17:1;
                uint32_t DSPICL18:1;
                uint32_t DSPICL19:1;
                uint32_t DSPICL20:1;
                uint32_t DSPICL21:1;
                uint32_t DSPICL22:1;
                uint32_t DSPICL23:1;
                uint32_t DSPICL24:1;
                uint32_t DSPICL25:1;
                uint32_t DSPICL26:1;
                uint32_t DSPICL27:1;
                uint32_t DSPICL28:1;
                uint32_t DSPICL29:1;
                uint32_t DSPICL30:1;
                uint32_t DSPICL31:1;
            } B;
        } DSPICHLC;

        int32_t SIU_reserved0D6C;  /* 0x0D6C-0x0D6F */

        union {               /* ETPU B Select Register */
            uint32_t R;
            struct {
                uint32_t ETPUB21:1;
                uint32_t ETPUB20:1;
                uint32_t ETPUB19:1;
                uint32_t ETPUB18:1;
                uint32_t ETPUB17:1;
                uint32_t ETPUB16:1;
                uint32_t:4;
                uint32_t ETPUB29:1;
                uint32_t ETPUB28:1;
                uint32_t ETPUB27:1;
                uint32_t ETPUB26:1;
                uint32_t ETPUB25:1;
                uint32_t ETPUB24:1;
                uint32_t:16;
            } B ;
        } ETPUBD;

        union {               /* EMIOS D Select Register */
            uint32_t R;
            struct {
                uint32_t:6;
                uint32_t EMIOS11:1;
                uint32_t EMIOS10:1;
                uint32_t EMIOS13:1;
                uint32_t EMIOS12:1;
                uint32_t:22;
            } B;
        } EMIOSD;

        union {             /* DSPIDH/L Select Register for DSPI D */
            uint32_t R;
            struct {
                uint32_t:32;
            } B;
        } DSPIDHLD;

        int32_t SIU_reserved0D7C;  /* 0x0D7C-0x0D7F */

        int32_t SIU_reserved0D80[32];  /* 0x0D80-0x0DFF */

        union {                 /* GPIO Pin Data Input Registers */
            uint8_t R;
            struct {
                uint8_t:7;
                uint8_t PDI:1;
            } B;
        } GPDI0_511[512];

        uint32_t SIU_reserved1000[3072];  /* 0x1000-0x3FFF */
    };

/****************************************************************************/
/*                          MODULE : EMIOS                                  */
/****************************************************************************/

    struct EMIOS_tag {

        union EMIOS_MCR_tag {    /* Module Configuration Register */
            uint32_t R;
            struct {
                uint32_t:1;
                uint32_t MDIS:1;
                uint32_t FRZ:1;
                uint32_t GTBE:1;
                uint32_t ETB:1;
                uint32_t GPREN:1;
                uint32_t:6;
                uint32_t SRV:4;
                uint32_t GPRE:8;
                uint32_t:8;
            } B;
        } MCR;

        union {                  /* Global FLAG Register */
            uint32_t R;
            struct {
                uint32_t F31:1;
                uint32_t F30:1;
                uint32_t F29:1;
                uint32_t F28:1;
                uint32_t F27:1;
                uint32_t F26:1;
                uint32_t F25:1;
                uint32_t F24:1;
                uint32_t F23:1;
                uint32_t F22:1;
                uint32_t F21:1;
                uint32_t F20:1;
                uint32_t F19:1;
                uint32_t F18:1;
                uint32_t F17:1;
                uint32_t F16:1;
                uint32_t F15:1;
                uint32_t F14:1;
                uint32_t F13:1;
                uint32_t F12:1;
                uint32_t F11:1;
                uint32_t F10:1;
                uint32_t F9:1;
                uint32_t F8:1;
                uint32_t F7:1;
                uint32_t F6:1;
                uint32_t F5:1;
                uint32_t F4:1;
                uint32_t F3:1;
                uint32_t F2:1;
                uint32_t F1:1;
                uint32_t F0:1;
            } B;
        } GFR;

        union {                 /* Output Update Disable Register */
            uint32_t R;
            struct {
                uint32_t OU31:1;
                uint32_t OU30:1;
                uint32_t OU29:1;
                uint32_t OU28:1;
                uint32_t OU27:1;
                uint32_t OU26:1;
                uint32_t OU25:1;
                uint32_t OU24:1;
                uint32_t OU23:1;
                uint32_t OU22:1;
                uint32_t OU21:1;
                uint32_t OU20:1;
                uint32_t OU19:1;
                uint32_t OU18:1;
                uint32_t OU17:1;
                uint32_t OU16:1;
                uint32_t OU15:1;
                uint32_t OU14:1;
                uint32_t OU13:1;
                uint32_t OU12:1;
                uint32_t OU11:1;
                uint32_t OU10:1;
                uint32_t OU9:1;
                uint32_t OU8:1;
                uint32_t OU7:1;
                uint32_t OU6:1;
                uint32_t OU5:1;
                uint32_t OU4:1;
                uint32_t OU3:1;
                uint32_t OU2:1;
                uint32_t OU1:1;
                uint32_t OU0:1;
            } B;
        } OUDR;

        uint32_t eMIOS_reserved000C[5]; /* 0x000C-0x001F */

        struct EMIOS_CH_tag {
            union {              /* Channel A Data Register */
                uint32_t R;
            } CADR;

