RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc567x.h
            union {              /* Channel B Data Register */
                uint32_t R;
            } CBDR;

            union {              /* Channel Counter Register */
                uint32_t R;
            } CCNTR;

            union EMIOS_CCR_tag {/* Channel Control Register */
                uint32_t R;
                struct {
                    uint32_t FREN:1;
                    uint32_t ODIS:1;
                    uint32_t ODISSL:2;
                    uint32_t UCPRE:2;
                    uint32_t UCPREN:1;
                    uint32_t DMA:1;
                    uint32_t:1;
                    uint32_t IF:4;
                    uint32_t FCK:1;
                    uint32_t FEN:1;
                    uint32_t:3;
                    uint32_t FORCMA:1;
                    uint32_t FORCMB:1;
                    uint32_t:1;
                    uint32_t BSL:2;
                    uint32_t EDSEL:1;
                    uint32_t EDPOL:1;
                    uint32_t MODE:7;
                } B;
            } CCR;

            union EMIOS_CSR_tag {/* Channel Status Register */
                uint32_t R;
                struct {
                    uint32_t OVR:1;
                    uint32_t:15;
                    uint32_t OVFL:1;
                    uint32_t:12;
                    uint32_t UCIN:1;
                    uint32_t UCOUT:1;
                    uint32_t FLAG:1;
                } B;
            } CSR;

            union {              /* Alternate Channel A Data Register */
                uint32_t R;
            } ALTA;

            uint32_t eMIOS_channel_reserved0018[2];  /* 0x0018-0x001F */

        } CH[32];

        uint32_t eMIOS_reserved0420[3832];  /* 0x0420-0x3FFF */

    };

/****************************************************************************/
/*                          MODULE : PMC                                    */
/****************************************************************************/

    struct PMC_tag {

        union {
            uint32_t R;
            struct {
                uint32_t LVRER:1;
                uint32_t LVREH:1;
                uint32_t LVRE50:1;
                uint32_t LVRE33:1;
                uint32_t LVREC:1;
                uint32_t LVREA:1;
                uint32_t:1;
                uint32_t:1;
                uint32_t LVIER:1;
                uint32_t LVIEH:1;
                uint32_t LVIE50:1;
                uint32_t LVIE33:1;
                uint32_t LVIEC:1;
                uint32_t LVIEA:1;
                uint32_t:1;
                uint32_t TLK:1;
                uint32_t:16;
            } B;
        } MCR;                  /* Module Configuration Register */

        union {
            uint32_t R;
            struct {
                uint32_t :8;
                uint32_t LVDATRIM:4;
                uint32_t LVDREGTRIM:4;
                uint32_t VDD33TRIM:4;
                uint32_t LVD33TRIM:4;
                uint32_t VDDCTRIM:4;
                uint32_t LVDCTRIM:4;
            } B;
        } TRIMR;                /* Trimming register */

        union {
            uint32_t R;
            struct {
                uint32_t :5;
                uint32_t LVFSTBY:1;
                uint32_t BGRDY:1;
                uint32_t BGTS:1;
                uint32_t :5;
                uint32_t LVFCSTBY:1;
                uint32_t :2;
                uint32_t LVFCR:1;
                uint32_t LVFCH:1;
                uint32_t LVFC50:1;
                uint32_t LVFC33:1;
                uint32_t LVFCC:1;
                uint32_t LVFCA:1;
                uint32_t :2;
                uint32_t LVFR:1;
                uint32_t LVFH:1;
                uint32_t LVF50:1;
                uint32_t LVF33:1;
                uint32_t LVFC:1;
                uint32_t LVFA:1;
                uint32_t :2;
            } B;
        } SR;                /* status register */

        uint32_t PMC_reserved000C[4093];  /* 0x000C-0x3FFF */
    };

/****************************************************************************/
/*                              MODULE :ETPU                                */
/****************************************************************************/

/***************************Configuration Registers**************************/

    struct ETPU_tag {
        union {                 /* MODULE CONFIGURATION REGISTER */
            uint32_t R;
            struct {
                uint32_t GEC:1;        /* Global Exception Clear */
                uint32_t SDMERR:1;     /* SDM Read Error */
                uint32_t WDTOA:1;      /* Watchdog Timeout-eTPU_A */
                uint32_t WDTOB:1;      /* Watchdog Timeout-eTPU_B */
                uint32_t MGE1:1;       /* Microcode Global Exception-ETPU_A */
                uint32_t MGE2:1;       /* Microcode Global Exception-ETPU_B */
                uint32_t ILF1:1;       /* Illegal Instruction Flag-ETPU_A */
                uint32_t ILF2:1;       /* Illegal Instruction Flag-ETPU_B */
                uint32_t:3;
                uint32_t SCMSIZE:5;    /* Shared Code Memory size */
                uint32_t:4;
                uint32_t SCMMISC:1;    /* SCM MISC Complete/Clear */
                uint32_t SCMMISF:1;    /* SCM MISC Flag */
                uint32_t SCMMISEN:1;   /* SCM MISC Enable */
                uint32_t:2;
                uint32_t VIS:1;        /* SCM Visability */
                uint32_t:5;
                uint32_t GTBE:1;       /* Global Time Base Enable */
            } B;
        } MCR;

        union {                 /* COHERENT DUAL-PARAMETER CONTROL */
            uint32_t R;
            struct {
                uint32_t STS:1;        /* Start Status bit */
                uint32_t CTBASE:5;     /* Channel Transfer Base */
                uint32_t PBASE:10;     /* Parameter Buffer Base Address */
                uint32_t PWIDTH:1;     /* Parameter Width */
                uint32_t PARAM0:7;     /* Channel Parameter 0 */
                uint32_t WR:1;         /* Read/Write selection */
                uint32_t PARAM1:7;     /* Channel Parameter 1 */
            } B;
        } CDCR;

