RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc567x.h
        uint32_t eTPU_reserved0008;  /* 0x0008-0x000B */

        union {                 /* MISC Compare Register */
            uint32_t R;
            struct {
                uint32_t ETPUMISCCMP:32;
            } B;
        } MISCCMPR;

        union {                 /* SCM off-range Date Register */
            uint32_t R;
            struct {
                uint32_t ETPUSCMOFFDATA:32;
            } B;
        } SCMOFFDATAR;

        union {                 /* ETPU_A Configuration Register */
            uint32_t R;
            struct {
                uint32_t FEND:1;       /* Force END */
                uint32_t MDIS:1;       /* Low power Stop */
                uint32_t:1;
                uint32_t STF:1;        /* Stop Flag */
                uint32_t:4;
                uint32_t HLTF:1;       /* Halt Mode Flag */
                uint32_t:3;
                uint32_t FCSS:1;       /* Filter Clock Source Select */
                uint32_t FPSCK:3;      /* Filter Prescaler Clock Control */
                uint32_t CDFC:2;
                uint32_t:1;
                uint32_t ERBA:5;       /* Engine Relative Base Address */
                uint32_t SPPDIS:1;     /* Schedule Priority Passing Disable */
                uint32_t:2;
                uint32_t ETB:5;        /* Entry Table Base */
            } B;
        } ECR_A;

        union {                 /* ETPU_B Configuration Register */
            uint32_t R;
            struct {
                uint32_t FEND:1;       /* Force END */
                uint32_t MDIS:1;       /* Low power Stop */
                uint32_t:1;
                uint32_t STF:1;        /* Stop Flag */
                uint32_t:4;
                uint32_t HLTF:1;       /* Halt Mode Flag */
                uint32_t:3;
                uint32_t FCSS:1;       /* Filter Clock Source Select */
                uint32_t FPSCK:3;      /* Filter Prescaler Clock Control */
                uint32_t CDFC:2;
                uint32_t:1;
                uint32_t ERBA:5;       /* Engine Relative Base Address */
                uint32_t SPPDIS:1;     /* Schedule Priority Passing Disable */
                uint32_t:2;
                uint32_t ETB:5;        /* Entry Table Base */
            } B;
        } ECR_B;

        uint32_t eTPU_reserved001C;  /* 0x001C-0x001F */

        union {                 /* ETPU_A Timebase Configuration Register */
            uint32_t R;
            struct {
                uint32_t TCR2CTL:3;     /* TCR2 Clock/Gate Control */
                uint32_t TCRCF:2;       /* TCRCLK Signal Filter Control */
                uint32_t AM:2;          /* Angle Mode */
                uint32_t:3;
                uint32_t TCR2P:6;       /* TCR2 Prescaler Control */
                uint32_t TCR1CTL:2;     /* TCR1 Clock/Gate Control */
                uint32_t TCR1CS:1;      /* TCR1 Clock Source */
                uint32_t:5;
                uint32_t TCR1P:8;       /* TCR1 Prescaler Control */
            } B;
        } TBCR_A;

        union {                 /* ETPU_A TCR1 Visibility Register */
            uint32_t R;
            struct {
                uint32_t:8;
                uint32_t TCR1:24;
            } B;
        } TB1R_A;

        union {                 /* ETPU_A TCR2 Visibility Register */
            uint32_t R;
            struct {
                uint32_t:8;
                uint32_t TCR2:24;
            } B;
        } TB2R_A;

        union {                 /* ETPU_A STAC Configuration Register */
            uint32_t R;
            struct {
                uint32_t REN1:1;       /* Resource Enable TCR1 */
                uint32_t RSC1:1;       /* Resource Control TCR1 */
                uint32_t:2;
                uint32_t SERVER_ID1:4;   /* TCR1 Server ID */
                uint32_t:4;
                uint32_t SRV1:4;       /* Resource Server Slot */
                uint32_t REN2:1;       /* Resource Enable TCR2 */
                uint32_t RSC2:1;       /* Resource Control TCR2 */
                uint32_t:2;
                uint32_t SERVER_ID2:4;   /* TCR2 Server ID */
                uint32_t:4;
                uint32_t SRV2:4;       /* Resource Server Slot */
            } B;
        } REDCR_A;

        uint32_t eTPU_reserved0030[4];  /* 0x0030-0x003F */

        union {                 /* ETPU_B Timebase Configuration Register */
            uint32_t R;
            struct {
                uint32_t TCR2CTL:3;     /* TCR2 Clock/Gate Control */
                uint32_t TCRCF:2;       /* TCRCLK Signal Filter Control */
                uint32_t AM:2;          /* Angle Mode */
                uint32_t:3;
                uint32_t TCR2P:6;       /* TCR2 Prescaler Control */
                uint32_t TCR1CTL:2;     /* TCR1 Clock/Gate Control */
                uint32_t TCR1CS:1;      /* TCR1 Clock Source */
                uint32_t:5;
                uint32_t TCR1P:8;       /* TCR1 Prescaler Control */
            } B;
        } TBCR_B;

        union {                 /* ETPU_B TCR1 Visibility Register */
            uint32_t R;
            struct {
                uint32_t:8;
                uint32_t TCR1:24;
            } B;
        } TB1R_B;

        union {                 /* ETPU_B TCR2 Visibility Register */
            uint32_t R;
            struct {
                uint32_t:8;
                uint32_t TCR2:24;
            } B;
        } TB2R_B;

        union {                 /* ETPU_B STAC Configuration Register */
            uint32_t R;
            struct {
                uint32_t REN1:1;       /* Resource Enable TCR1 */
                uint32_t RSC1:1;       /* Resource Control TCR1 */
                uint32_t:2;
                uint32_t SERVER_ID1:4;   /* TCR1 Server ID */
                uint32_t:4;
                uint32_t SRV1:4;       /* Resource Server Slot */
                uint32_t REN2:1;       /* Resource Enable TCR2 */
                uint32_t RSC2:1;       /* Resource Control TCR2 */
                uint32_t:2;
                uint32_t SERVER_ID2:4;   /* TCR2 Server ID */
                uint32_t:4;
                uint32_t SRV2:4;       /* Resource Server Slot */
            } B;
        } REDCR_B;

        uint32_t eTPU_reserved0050[4];  /* 0x0050-0x005F */

