RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc567x.h
        uint32_t eTPU_reserved02A0[88];  /* 0x02A0-0x03FF */

/*****************************Channels********************************/

        struct {
            union {    /* Channel Configuration Register */
                uint32_t R;
                struct {
                    uint32_t CIE:1;    /* Channel Interruput Enable */
                    uint32_t DTRE:1;   /* Data Transfer Request Enable */
                    uint32_t CPR:2;    /* Channel Priority */
                    uint32_t:2;
                    uint32_t ETPD:1;
                    uint32_t ETCS:1;   /* Entry Table Condition Select */
                    uint32_t:3;
                    uint32_t CFS:5;    /* Channel Function Select */
                    uint32_t ODIS:1;   /* Output disable */
                    uint32_t OPOL:1;   /* output polarity */
                    uint32_t:3;
                    uint32_t CPBA:11;  /* Channel Parameter Base Address */
                } B;
            } CR;

            union {    /* Channel Status Control Register */
                uint32_t R;
                struct {
                    uint32_t CIS:1;    /* Channel Interruput Status */
                    uint32_t CIOS:1;   /* Channel Interruput Overflow Status */
                    uint32_t:6;
                    uint32_t DTRS:1;   /* Data Transfer Status */
                    uint32_t DTROS:1;  /* Data Transfer Overflow Status */
                    uint32_t:6;
                    uint32_t IPS:1;    /* Input Pin State */
                    uint32_t OPS:1;    /* Output Pin State */
                    uint32_t OBE:1;    /* Output Buffer Enable */
                    uint32_t:11;
                    uint32_t FM1:1;    /* Function mode */
                    uint32_t FM0:1;    /* Function mode */
                } B;
            } SCR;

            union {    /* Channel Host Service Request Register */
                uint32_t R;
                struct {
                    uint32_t:29;       /* Host Service Request */
                    uint32_t HSR:3;
                } B;
            } HSRR;

            uint32_t eTPU_ch_reserved00C;  /* channel offset 0x00C-0x00F */

        } CHAN[127];

        uint32_t eTPU_reserved1000[7168];  /* 0x1000-0x7FFF */

    };

/****************************************************************************/
/*                          MODULE : PIT / RTI                              */
/****************************************************************************/

    struct PIT_tag {
        union {                  /* Module Configuration Register */
            uint32_t R;
            struct {
                uint32_t:29;
                uint32_t MDIS_RTI:1;
                uint32_t MDIS:1;
                uint32_t FRZ:1;
            } B;
        } MCR;

        uint32_t PIT_reserved0004[59];  /* 0x0004-0x00EF */

        struct {
            union {
                uint32_t R;    /* <URM>TSVn</URM> */
            } LDVAL;            /* Timer Load Value Register */

            union {
                uint32_t R;    /* <URM>TVLn</URM> */
            } CVAL;             /* Current Timer Value Register */

            union {
                uint32_t R;
                struct {
                    uint32_t:30;
                    uint32_t TIE:1;
                    uint32_t TEN:1;
                } B;
            } TCTRL;            /* Timer Control Register */

            union {
                uint32_t R;
                struct {
                    uint32_t:31;
                    uint32_t TIF:1;
                } B;
            } TFLG;             /* Timer Flag Register */
        } RTI;                  /* RTI Channel */

        struct {
            union {
                uint32_t R;
                struct {
                    uint32_t TSV:32;
                } B;
            } LDVAL;

            union {
                uint32_t R;
                struct {
                    uint32_t TVL:32;
                } B;
            } CVAL;

            union {
                uint32_t R;
                struct {
                    uint32_t:30;
                    uint32_t TIE:1;
                    uint32_t TEN:1;
                } B;
            } TCTRL;

            union {
                uint32_t R;
                struct {
                    uint32_t:31;
                    uint32_t TIF:1;
                } B;
            } TFLG;
        } CH[4];

        uint32_t PIT_reserved00140[4016];  /* 0x0140-0x3FFF */
    };

/****************************************************************************/
/*                          MODULE : XBAR CrossBar                          */
/****************************************************************************/

    struct XBAR_tag {

        union {                 /* Master Priority Register for Slave Port 0 */
            uint32_t R;
            struct {
                uint32_t:1;
                uint32_t MSTR7:3; /* EBI (development bus) */
                uint32_t:1;
                uint32_t MSTR6:3; /* FlexRay */
                uint32_t:1;
                uint32_t MSTR5:3; /* eDMA_B */
                uint32_t:1;
                uint32_t MSTR4:3; /* eDMA_A */
                uint32_t:1;
                uint32_t MSTR3:3; /* !!! Unsupported in Mamba !!! - Legacy FEC */
                uint32_t:1;
                uint32_t MSTR2:3; /* !!! Unsupported in Mamba !!! - Legacy EBI */
                uint32_t:1;
                uint32_t MSTR1:3; /* e200z7 core-Data, and Nexus 3 - Legacy was eDMA_A */
                uint32_t:1;
                uint32_t MSTR0:3; /* e200z7 core-CPU Instruction - Legacy was z6 core-Instruction/Data & Nexus */
            } B;
        } MPR0;

        uint32_t XBAR_reserved0004[3];  /* 0x0004-0x000F */

        union {               /* General Purpose Control Register for Slave Port 0 */
            uint32_t R;
            struct {
                uint32_t RO:1;
                uint32_t:21;
                uint32_t ARB:2;
                uint32_t:2;
                uint32_t PCTL:2;
                uint32_t:1;
                uint32_t PARK:3;
            } B;
        } SGPCR0;

        uint32_t XBAR_reserved0014[59];  /* 0x0014-0x00FF */

        union {                 /* Master Priority Register for Slave Port 1 */
            uint32_t R;
            struct {
                uint32_t:1;
                uint32_t MSTR7:3; /* EBI (development bus) */
                uint32_t:1;
                uint32_t MSTR6:3; /* FlexRay */
                uint32_t:1;
                uint32_t MSTR5:3; /* eDMA_B */
                uint32_t:1;
                uint32_t MSTR4:3; /* eDMA_A */
                uint32_t:1;
                uint32_t MSTR3:3; /* !!! Unsupported in Mamba !!! - Legacy FEC */
                uint32_t:1;
                uint32_t MSTR2:3; /* !!! Unsupported in Mamba !!! - Legacy EBI */
                uint32_t:1;
                uint32_t MSTR1:3; /* e200z7 core-Data, and Nexus 3 - Legacy was eDMA_A */
                uint32_t:1;
                uint32_t MSTR0:3; /* e200z7 core-CPU Instruction - Legacy was z6 core-Instruction/Data & Nexus */
            } B;
        } MPR1;

        uint32_t XBAR_reserved0104[3];  /* 0x0104-0x010F */

        union {               /* General Purpose Control Register for Slave Port 1 */
            uint32_t R;
            struct {
                uint32_t RO:1;
                uint32_t:21;
                uint32_t ARB:2;
                uint32_t:2;
                uint32_t PCTL:2;
                uint32_t:1;
                uint32_t PARK:3;
            } B;
        } SGPCR1;

        uint32_t XBAR_reserved0114[59];  /* 0x0114-0x01FF */

