RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc567x.h
        union {                 /* Master Priority Register for Slave Port 2 */
            uint32_t R;
            struct {
                uint32_t:1;
                uint32_t MSTR7:3; /* EBI (development bus) */
                uint32_t:1;
                uint32_t MSTR6:3; /* FlexRay */
                uint32_t:1;
                uint32_t MSTR5:3; /* eDMA_B */
                uint32_t:1;
                uint32_t MSTR4:3; /* eDMA_A */
                uint32_t:1;
                uint32_t MSTR3:3; /* !!! Unsupported in Mamba !!! - Legacy FEC */
                uint32_t:1;
                uint32_t MSTR2:3; /* !!! Unsupported in Mamba !!! - Legacy EBI */
                uint32_t:1;
                uint32_t MSTR1:3; /* e200z7 core-Data, and Nexus 3 - Legacy was eDMA_A */
                uint32_t:1;
                uint32_t MSTR0:3; /* e200z7 core-CPU Instruction - Legacy was z6 core-Instruction/Data & Nexus */
            } B;
        } MPR2;

        uint32_t XBAR_reserved0204[3];  /* 0x0204-0x020F */

        union {               /* General Purpose Control Register for Slave Port 2 */
            uint32_t R;
            struct {
                uint32_t RO:1;
                uint32_t:21;
                uint32_t ARB:2;
                uint32_t:2;
                uint32_t PCTL:2;
                uint32_t:1;
                uint32_t PARK:3;
            } B;
        } SGPCR2;

        uint32_t XBAR_reserved0214[59];  /* 0x0214-0x02FF */

        uint32_t XBAR_reserved0300[64];  /* 0x0300-0x03FF */

        uint32_t XBAR_reserved0400[64];  /* 0x0400-0x04FF */

        uint32_t XBAR_reserved0500[64];  /* 0x0500-0x05FF */

        union {                 /* Master Priority Register for Slave Port 6 */
            uint32_t R;
            struct {
                uint32_t:1;
                uint32_t MSTR7:3; /* EBI (development bus) */
                uint32_t:1;
                uint32_t MSTR6:3; /* FlexRay */
                uint32_t:1;
                uint32_t MSTR5:3; /* eDMA_B */
                uint32_t:1;
                uint32_t MSTR4:3; /* eDMA_A */
                uint32_t:1;
                uint32_t MSTR3:3; /* !!! Unsupported in Mamba !!! - Legacy FEC */
                uint32_t:1;
                uint32_t MSTR2:3; /* !!! Unsupported in Mamba !!! - Legacy EBI */
                uint32_t:1;
                uint32_t MSTR1:3; /* e200z7 core-Data, and Nexus 3 - Legacy was eDMA_A */
                uint32_t:1;
                uint32_t MSTR0:3; /* e200z7 core-CPU Instruction - Legacy was z6 core-Instruction/Data & Nexus */
            } B;
        } MPR6;

        uint32_t XBAR_reserved604[3];  /* 0x0604-0x060F */

        union {               /* General Purpose Control Register for Slave Port 6 */
            uint32_t R;
            struct {
                uint32_t RO:1;
                uint32_t:21;
                uint32_t ARB:2;
                uint32_t:2;
                uint32_t PCTL:2;
                uint32_t:1;
                uint32_t PARK:3;
            } B;
        } SGPCR6;

        uint32_t XBAR_reserved0614[59];  /* 0x0614-0x06FF */

        union {                 /* Master Priority Register for Slave Port 7 */
            uint32_t R;
            struct {
                uint32_t:1;
                uint32_t MSTR7:3; /* EBI (development bus) */
                uint32_t:1;
                uint32_t MSTR6:3; /* FlexRay */
                uint32_t:1;
                uint32_t MSTR5:3; /* eDMA_B */
                uint32_t:1;
                uint32_t MSTR4:3; /* eDMA_A */
                uint32_t:1;
                uint32_t MSTR3:3; /* !!! Unsupported in Mamba !!! - Legacy FEC */
                uint32_t:1;
                uint32_t MSTR2:3; /* !!! Unsupported in Mamba !!! - Legacy EBI */
                uint32_t:1;
                uint32_t MSTR1:3; /* e200z7 core-Data, and Nexus 3 - Legacy was eDMA_A */
                uint32_t:1;
                uint32_t MSTR0:3; /* e200z7 core-CPU Instruction - Legacy was z6 core-Instruction/Data & Nexus */
            } B;
        } MPR7;

        uint32_t XBAR_reserved704[3];  /* 0x0704-0x070F */

        union {
            uint32_t R;
            struct {
                uint32_t RO:1;
                  uint32_t:21;
                uint32_t ARB:2;
                  uint32_t:2;
                uint32_t PCTL:2;
                  uint32_t:1;
                uint32_t PARK:3;
            } B;
        } SGPCR7;               /* General Purpose Control Register for Slave Port 7 */

        uint32_t XBAR_reserved0714[59];  /* 0x0714-0x07FF */

        uint32_t XBAR_reserved0800[3584];  /* 0x0800-0x3FFF */
    };

/****************************************************************************/
/*                          MODULE : MPU                                    */
/****************************************************************************/

    struct MPU_tag {

        union {                 /* Module Control/Error Status Register */
            uint32_t R;
            struct {
                uint32_t SPERR:8;
                  uint32_t:4;
                uint32_t HRL:4;
                uint32_t NSP:4;
                uint32_t NRGD:4;
                  uint32_t:7;
                uint32_t VLD:1;
            } B;
        } CESR;

        uint32_t MPU_reserved0004[3]; /* 0x0004-0x000F */

        struct {
            union {             /* MPU Error Address Registers */
                uint32_t R;
                struct {
                    uint32_t EADDR:32;
                } B;
            } EAR;

            union {             /* MPU Error Detail Registers */
                uint32_t R;
                struct {
                    uint32_t EACD:16;
                    uint32_t EPID:8;
                    uint32_t EMN:4;
                    uint32_t EATTR:3;
                    uint32_t ERW:1;
                } B;
            } EDR;
        } PORT[3];

        uint32_t MPU_reserved0028[246];  /* 0x0028-0x03FF */

        struct {
            union {            /* Region Descriptor n Word 0 */
                uint32_t R;
                struct {
                    uint32_t SRTADDR:27;
                    uint32_t:5;
                } B;
            } WORD0;

