RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc567x.h
            union {            /* Region Descriptor n Word 1 */
                uint32_t R;
                struct {
                    uint32_t ENDADDR:27;
                    uint32_t:5;
                } B;
            } WORD1;

            union {            /* Region Descriptor n Word 2 */
                uint32_t R;
                struct {
                    uint32_t M7RE:1;
                    uint32_t M7WE:1;
                    uint32_t M6RE:1;
                    uint32_t M6WE:1;
                    uint32_t M5RE:1;
                    uint32_t M5WE:1;
                    uint32_t M4RE:1;
                    uint32_t M4WE:1;
                    uint32_t: 18;
                    uint32_t M0PE:1;
                    uint32_t M0SM:2;
                    uint32_t M0UM:3;
                } B;
            } WORD2;

            union {            /* Region Descriptor n Word 3 */
                uint32_t R;
                struct {
                    uint32_t PID:8;
                    uint32_t PIDMASK:8;
                      uint32_t:15;
                    uint32_t VLD:1;
                } B;
            } WORD3;
        } RGD[16];

        uint32_t MPU_reserved0500[192];  /* 0x0500-0x07FF */

        union {           /* Region Descriptor Alternate Access Control n */
            uint32_t R;
            struct {
                uint32_t:6;
                uint32_t M4RE:1;
                uint32_t M4WE:1;
                uint32_t M3PE:1;
                uint32_t M3SM:2;
                uint32_t M3UM:3;
                uint32_t M2PE:1;
                uint32_t M2SM:2;
                uint32_t M2UM:3;
                uint32_t M1PE:1;
                uint32_t M1SM:2;
                uint32_t M1UM:3;
                uint32_t M0PE:1;
                uint32_t M0SM:2;
                uint32_t M0UM:3;
            } B;
        } RGDAAC[16];

        uint32_t MPU_reserved0840[3568];  /* 0x0840-0x3FFF */

    };

/****************************************************************************/
/*                     MODULE : SWT                                         */
/****************************************************************************/

    struct SWT_tag {

        union {                  /* Module Configuration Register */
            uint32_t R;
            struct {
                uint32_t MAP0:1;
                uint32_t MAP1:1;
                uint32_t:1;
                uint32_t:1;
                uint32_t MAP4:1;
                uint32_t MAP5:1;
                uint32_t MAP6:1;
                uint32_t MAP7:1;
                uint32_t:14;
                uint32_t KEY:1;
                uint32_t RIA:1;
                uint32_t WND:1;
                uint32_t ITR:1;
                uint32_t HLK:1;
                uint32_t SLK:1;
                uint32_t CSL:1;
                uint32_t STP:1;
                uint32_t FRZ:1;
                uint32_t WEN:1;
            } B;
        } MCR;

        union {                /* Interrupt register */
            uint32_t R;
            struct {
                uint32_t :31;
                uint32_t TIF:1;
            } B;
        } IR;

        union {                /* Timeout register */
            uint32_t R;
            struct {
                uint32_t WTO:32;
            } B;
        } TO;

        union {                /* Window register */
            uint32_t R;
            struct {
                uint32_t WST:32;
            } B;
        } WN;

        union {                /* Service register */
            uint32_t R;
            struct {
                uint32_t :16;
                uint32_t WSC:16;
            } B;
        } SR;

        union {                /* Counter output register */
            uint32_t R;
            struct {
                uint32_t CNT:32;
            } B;
        } CO;

        union {                /* Service key register */
            uint32_t R;
            struct {
                uint32_t :16;
                uint32_t SK:16;
            } B;
        } SK;

        uint32_t SWT_reserved001C[4089]; /* 0x001C-0x3FFF */

    };

/****************************************************************************/
/*                     MODULE : STM                                         */
/****************************************************************************/

    struct STM_tag {

        union {                  /* Control Register */
            uint32_t R;
            struct {
                uint32_t :16;
                uint32_t CPS:8;
                uint32_t :6;
                uint32_t FRZ:1;
                uint32_t TEN:1;
            } B;
        } CR;

        union {                /* STM Counter */
            uint32_t R;
        } CNT;

        uint32_t STM_reserved0008[2];  /* 0x0008-0x000F */

 /* channel 0 registers */
		union {
            uint32_t R;
            struct {
                uint32_t :31;
             	uint32_t CEN:1;
            } B;
        } CCR0;                /* Chan 0 Control Register */

        union {
    	    uint32_t R;
            struct {
                uint32_t :31;
                uint32_t CIF:1;
        	} B;
        } CIR0;                /* Chan 0 Interrupt Register */

		union {
    	    uint32_t R;
        } CMP0;                /* Chan 0 Compare Register */

		uint32_t STM_reserved2[1];

/* channel 1 registers */
		union {
            uint32_t R;
            struct {
                uint32_t :31;
             	uint32_t CEN:1;
            } B;
        } CCR1;                /* Chan 1 Control Register */

        union {
    	    uint32_t R;
            struct {
                uint32_t :31;
                uint32_t CIF:1;
        	} B;
        } CIR1;                /* Chan 1 Interrupt Register */

		union {
    	    uint32_t R;
        } CMP1;                /* Chan 1 Compare Register */

		uint32_t STM_reserved3[1];

/* channel 2 registers */
		union {
            uint32_t R;
            struct {
                uint32_t :31;
             	uint32_t CEN:1;
            } B;
        } CCR2;                /* Chan 2 Control Register */

        union {
    	    uint32_t R;
            struct {
                uint32_t :31;
                uint32_t CIF:1;
        	} B;
        } CIR2;                /* Chan 2 Interrupt Register */

		union {
    	    uint32_t R;
        } CMP2;                /* Chan 2 Compare Register */

		uint32_t STM_reserved4[1];

