RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc567x.h
/* channel 3 registers */
		union {
            uint32_t R;
            struct {
                uint32_t :31;
             	uint32_t CEN:1;
            } B;
        } CCR3;                /* Chan 3 Control Register */

        union {
    	    uint32_t R;
            struct {
                uint32_t :31;
                uint32_t CIF:1;
        	} B;
        } CIR3;                /* Chan 3 Interrupt Register */

		union {
    	    uint32_t R;
        } CMP3;                /* Chan 3 Compare Register */

        uint32_t STM_reserved0050[4076];  /* 0x0050-0x3FFF */

    };

/****************************************************************************/
/*                     MODULE : ECSM                                        */
/****************************************************************************/

    struct ECSM_tag {

        union {                /* Processor core type */
            uint16_t R;
        } PCT;

        union {                /* Platform revision */
            uint16_t R;
        } REV;

        uint32_t ECSM_reserved0004;  /* 0x0004-0x0007 */

        union {                 /* IPS Module Configuration */
            uint32_t R;
        } IMC;

        uint8_t ECSM_reserved000C[3];  /* 0x000C-0x000E */

        union {                 /* Miscellaneous Reset Status Register */
            uint8_t R;
            struct {
                uint8_t POR:1;
                uint8_t DIR:1;
                uint8_t SWTR:1;
                uint8_t:5;
            } B;
        } MRSR;

        uint8_t ECSM_reserved0010[51]; /* 0x0010-0x0042 */

        union {                  /* ECC Configuration Register */
            uint8_t R;
            struct {
                uint8_t:2;
                uint8_t ER1BR:1;
                uint8_t EF1BR:1;
                uint8_t:2;
                uint8_t ERNCR:1;
                uint8_t EFNCR:1;
            } B;
        } ECR;

        uint8_t ECSM_reserved0044[3];  /* 0x0044-0x0046 */

        union {                  /* ECC Status Register */
            uint8_t R;
            struct {
                uint8_t:2;
                uint8_t R1BC:1;
                uint8_t F1BC:1;
                uint8_t:2;
                uint8_t RNCE:1;
                uint8_t FNCE:1;
            } B;
        } ESR;

    uint16_t ECSM_reserved0048; /* 0x0048-0x0049 */

        union {                 /* ECC Error Generation Register */
            uint16_t R;
            struct {
                uint16_t:2;
                uint16_t FRC1BI:1;
                uint16_t FR11BI:1;
                uint16_t:2;
                uint16_t FRCNCI:1;
                uint16_t FR1NCI:1;
                uint16_t:1;
                uint16_t ERRBIT:7;
            } B;
        } EEGR;

        uint32_t ECSM_reserved004C; /* 0x004C-0x004F */

        union {                 /* Flash ECC Address Register */
            uint32_t R;
            struct {
                uint32_t FEAR:32;
            } B;
        } FEAR;

        uint16_t ECSM_reserved0054; /* 0x0054-0x0055 */

        union {                 /* Flash ECC Master Number Register */
            uint8_t R;
            struct {
                uint8_t:4;
                uint8_t FEMR:4;
            } B;
        } FEMR;

        union {                 /* Flash ECC Attributes Register */
            uint8_t R;
            struct {
                uint8_t WRITE:1;
                uint8_t SIZE:3;
                uint8_t PROT0:1;
                uint8_t PROT1:1;
                uint8_t PROT2:1;
                uint8_t PROT3:1;
            } B;
        } FEAT;

        union {                /* Flash ECC Data Register High */
            uint32_t R;
            struct {
                uint32_t FEDH:32;
            } B;
        } FEDRH;

        union {                /* Flash ECC Data Register Low */
            uint32_t R;
            struct {
                uint32_t FEDL:32;
            } B;
        } FEDRL;

        union {                /* RAM ECC Address Register */
            uint32_t R;
            struct {
                uint32_t REAR:32;
            } B;
        } REAR;

        uint16_t ECSM_reserved0064; /* 0x0064-0x0065 */

        union {                 /* RAM ECC Master Number Register */
            uint8_t R;
            struct {
                uint8_t:4;
                uint8_t REMR:4;
            } B;
        } REMR;

        union {                 /* RAM ECC Attributes Register */
            uint8_t R;
            struct {
                uint8_t WRITE:1;
                uint8_t SIZE:3;
                uint8_t PROT0:1;
                uint8_t PROT1:1;
                uint8_t PROT2:1;
                uint8_t PROT3:1;
            } B;
        } REAT;

        union {                /* RAM ECC Data Register */
            uint32_t R;
            struct {
                uint32_t REDH:32;
            } B;
        } REDRH;

        union {                /* RAM ECC Data Register */
            uint32_t R;
            struct {
                uint32_t REDL:32;
            } B;
        } REDRL;

        uint32_t ECSM_reserved0070[4068]; /* 0x0070-0x3FFF */

    };

/****************************************************************************/
/*                          MODULE : INTC                                   */
/****************************************************************************/

    struct INTC_tag {

        union {                  /* Module Configuration Register */
            uint32_t R;
            struct {
                uint32_t:26;
                uint32_t VTES:1;
                uint32_t:4;
                uint32_t HVEN:1;
            } B;
        } MCR;

        uint32_t INTC_reserved0004;  /* 0x0004-0x0007 */

        union {                  /* Current Priority Register */
            uint32_t R;
            struct {
                uint32_t:28;
                uint32_t PRI:4;
            } B;
        } CPR;

        uint32_t INTC_reserved000C;  /* 0x000C-0x000F */

        union {                /* Interrupt Acknowledge Register */
            uint32_t R;
            struct {
                uint32_t VTBA:21;
                uint32_t INTVEC:9;
                  uint32_t:2;
            } B;
        } IACKR;

        uint32_t INTC_reserved0014;  /* 0x0014-0x0017 */

        union {                 /* End of Interrupt Register */
            uint32_t R;
            struct {
                uint32_t EOIR:32;
            } B;
        } EOIR;

