RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc567x.h
        uint32_t INTC_reserved001C;  /* 0x001C-0x001F */

        union {             /* Software Set/Clear Interruput Register */
            uint8_t R;
            struct {
                uint8_t:6;
                uint8_t SET:1;
                uint8_t CLR:1;
            } B;
        } SSCIR[8];

        uint32_t INTC_reserved0028[6]; /* 0x0028-0x003F */

        union {             /* Software Set/Clear Interrupt Register */
            uint8_t R;
            struct {
                uint8_t:4;
                uint8_t PRI:4;
            } B;
        } PSR[480];

        uint16_t INTC_reserved0220[7920]; /* 0x0220-0x3FFF */

    };

/****************************************************************************/
/*                          MODULE : EQADC                                  */
/****************************************************************************/

    struct EQADC_tag {

        union EQADC_MCR_tag {  /* Module Configuration Register */
            uint32_t R;
            struct {
                uint32_t:24;
                uint32_t ICEA0:1;
                uint32_t ICEA1:1;
                uint32_t:1;
                uint32_t ESSIE:2;
                uint32_t:1;
                uint32_t DBG:2;
            } B;
        } MCR;

        uint32_t eQADC_reserved0004;  /* 0x0004-0x0007 */

        union EQADC_NMSFR_tag { /* Null Message Send Format Register */
            uint32_t R;
            struct {
                uint32_t:6;
                uint32_t NMF:26;
            } B;
        } NMSFR;

        union EQADC_ETDFR_tag { /* External Trigger Digital Filter Register */
            uint32_t R;
            struct {
                uint32_t:28;
                uint32_t DFL:4;
            } B;
        } ETDFR;

        union EQADC_CFPR_tag { /* CFIFO Push Registers */
            uint32_t R;
            struct {
                uint32_t CFPUSH:32;
            } B;
        } CFPR[6];

        uint32_t eQADC_reserved0028[2];  /* 0x0028-0x002F */

        union EQADC_RFPR_tag { /* Result FIFO Pop Registers */
            uint32_t R;
            struct {
                uint32_t:16;
                uint32_t RFPOP:16;
            } B;
        } RFPR[6];

        uint32_t eQADC_reserved0048[2];  /* 0x0048-0x004F */

        union EQADC_CFCR_tag { /* CFIFO Control Registers */
            uint16_t R;
            struct {
                uint16_t:3;
                uint16_t CFEEE0:1;
                uint16_t STRME0:1;
                uint16_t SSE:1;
                uint16_t CFINV:1;
                uint16_t:1;
                uint16_t MODE:4;
                uint16_t AMODE0:4;
            } B;
        } CFCR[6];

        uint32_t eQADC_reserved005C;  /* 0x005C-0x005F */

        union EQADC_IDCR_tag { /* Interrupt and DMA Control Registers */
            uint16_t R;
            struct {
                uint16_t NCIE:1;
                uint16_t TORIE:1;
                uint16_t PIE:1;
                uint16_t EOQIE:1;
                uint16_t CFUIE:1;
                uint16_t:1;
                uint16_t CFFE:1;
                uint16_t CFFS:1;
                uint16_t:4;
                uint16_t RFOIE:1;
                uint16_t:1;
                uint16_t RFDE:1;
                uint16_t RFDS:1;
            } B;
        } IDCR[6];

        uint32_t eQADC_reserved006C;  /* 0x006C-0x006F */

        union {              /* FIFO and Interrupt Status Registers */
            uint32_t R;
            struct {
                uint32_t NCF:1;
                uint32_t TORF:1;
                uint32_t PF:1;
                uint32_t EOQF:1;
                uint32_t CFUF:1;
                uint32_t SSS:1;
                uint32_t CFFF:1;
                uint32_t:5;
                uint32_t RFOF:1;
                uint32_t:1;
                uint32_t RFDF:1;
                uint32_t:1;
                uint32_t CFCTR:4;
                uint32_t TNXTPTR:4;
                uint32_t RFCTR:4;
                uint32_t POPNXTPTR:4;
            } B;
        } FISR[6];

        uint32_t eQADC_reserved0088[2];  /* 0x0088-0x008F */

        union {             /* CFIFO Transfer Counter Registers */
            uint16_t R;
            struct {
                uint16_t:5;
                uint16_t TCCF:11; /* Legacy naming - refer to TC_CF in Reference Manual */
            } B;
        } CFTCR[6];

        uint32_t eQADC_reserved009C[1];  /* 0x009F */

        union {               /* CFIFO Status Register 0 */
            uint32_t R;
            struct {
                uint32_t CFS0:2; /* Legacy naming - refer to CFS0_TCB0 in Reference Manual */
                uint32_t CFS1:2; /* Legacy naming - refer to CFS1_TCB0 in Reference Manual */
                uint32_t CFS2:2; /* Legacy naming - refer to CFS2_TCB0 in Reference Manual */
                uint32_t CFS3:2; /* Legacy naming - refer to CFS3_TCB0 in Reference Manual */
                uint32_t CFS4:2; /* Legacy naming - refer to CFS4_TCB0 in Reference Manual */
                uint32_t CFS5:2; /* Legacy naming - refer to CFS5_TCB0 in Reference Manual */
                uint32_t:5;
                uint32_t LCFTCB0:4;
                uint32_t TC_LCFTCB0:11;
            } B;
        } CFSSR0;

        union {               /* CFIFO Status Register 1 */
            uint32_t R;
            struct {
                uint32_t CFS0:2; /* Legacy naming - refer to CFS0_TCB1 in Reference Manual */
                uint32_t CFS1:2; /* Legacy naming - refer to CFS1_TCB1 in Reference Manual */
                uint32_t CFS2:2; /* Legacy naming - refer to CFS2_TCB1 in Reference Manual */
                uint32_t CFS3:2; /* Legacy naming - refer to CFS3_TCB1 in Reference Manual */
                uint32_t CFS4:2; /* Legacy naming - refer to CFS4_TCB1 in Reference Manual */
                uint32_t CFS5:2; /* Legacy naming - refer to CFS5_TCB1 in Reference Manual */
                uint32_t:5;
                uint32_t LCFTCB1:4;
                uint32_t TC_LCFTCB1:11;
            } B;
        } CFSSR1;

        union {               /* CFIFO Status Register 2 */
            uint32_t R;
            struct {
                uint32_t CFS0:2; /* Legacy naming - refer to CFS0_TSSI in Reference Manual */
                uint32_t CFS1:2; /* Legacy naming - refer to CFS1_TSSI in Reference Manual */
                uint32_t CFS2:2; /* Legacy naming - refer to CFS2_TSSI in Reference Manual */
                uint32_t CFS3:2; /* Legacy naming - refer to CFS3_TSSI in Reference Manual */
                uint32_t CFS4:2; /* Legacy naming - refer to CFS4_TSSI in Reference Manual */
                uint32_t CFS5:2; /* Legacy naming - refer to CFS5_TSSI in Reference Manual */
                uint32_t:4;
                uint32_t ECBNI:1;
                uint32_t LCFTSSI:4;
                uint32_t TC_LCFTSSI:11;
            } B;
        } CFSSR2;

