RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc567x.h
        union {                 /* CFIFO Status Register */
            uint32_t R;
            struct {
                uint32_t CFS0:2;
                uint32_t CFS1:2;
                uint32_t CFS2:2;
                uint32_t CFS3:2;
                uint32_t CFS4:2;
                uint32_t CFS5:2;
                  uint32_t:20;
            } B;
        } CFSR;

        uint32_t eQADC_reserved00B0;  /* 0x00B0-0x00B3 */

        union EQADC_SSICR_tag { /* SSI Control Register */
            uint32_t R;
            struct {
                uint32_t:21;
                uint32_t MDT:3;
                uint32_t:4;
                uint32_t BR:4;
            } B;
        } SSICR;

        union {               /* SSI Recieve Data Register */
            uint32_t R;
            struct {
                uint32_t RDV:1;
                uint32_t:5;
                uint32_t RDATA:26;
            } B;
        } SSIRDR;

        uint32_t eQADC_reserved00BC[17];  /* 0x00BC-0x00FF */

        struct {
            union {
                uint32_t R;
                struct {
                    uint32_t CFIFO_DATA:32;
                } B;
            } R[4];

            uint32_t eQADC_cf_reserved010[12];  /* CFIFO offset 0x010-0x03F */

        } CF[6];

        uint32_t eQADC_reserved0280[32];  /* 0x0280-0x02FF */

        struct {
            union {
                uint32_t R;
                struct {
                    uint32_t RFIFO_DATA:32;
                } B;
            } R[4];

            uint32_t eQADC_rf_reserved010[12];  /* RFIFO offset 0x010-0x03F */

        } RF[6];

        uint32_t eQADC_reserved0480[3808];  /* 0x0480-0x3FFF */
    };

/****************************************************************************/
/*                          MODULE : Decimation Filter                      */
/****************************************************************************/

    struct DECFIL_tag {

        union {                  /* Module Configuration Register */
            uint32_t R;
            struct {
                uint32_t MDIS:1;
                uint32_t FREN:1;
                uint32_t :1;
                uint32_t FRZ:1;
                uint32_t SRES:1;
                uint32_t CASCD:2;
                uint32_t IDEN:1;
                uint32_t ODEN:1;
                uint32_t ERREN:1;
                uint32_t :1;
                uint32_t FTYPE:2;
                uint32_t :1;
                uint32_t SCAL:2;
                uint32_t :1;
                uint32_t SAT:1;
                uint32_t ISEL:1;
                uint32_t :1;
                uint32_t DEC_RATE:4;
                uint32_t :1;
                uint32_t DSEL:1;
                uint32_t IBIE:1;
                uint32_t OBIE:1;
                uint32_t EDME:1;
                uint32_t TORE:1;
                uint32_t TRFE:1;
                uint32_t :1;
            } B;
        } MCR;

        union {                  /* Module Status Register */
            uint32_t R;
            struct {
                uint32_t BSY:1;
                uint32_t:1;
                uint32_t DEC_COUNTER:4;
                uint32_t IDFC:1;
                uint32_t ODFC:1;
                uint32_t:1;
                uint32_t IBIC:1;
                uint32_t OBIC:1;
                uint32_t:1;
                uint32_t DIVRC:1;
                uint32_t OVFC:1;
                uint32_t OVRC:1;
                uint32_t IVRC:1;
                uint32_t:6;
                uint32_t IDF:1;
                uint32_t ODF:1;
                uint32_t:1;
                uint32_t IBIF:1;
                uint32_t OBIF:1;
                uint32_t:1;
                uint32_t DIVR:1;
                uint32_t OVF:1;
                uint32_t OVR:1;
                uint32_t IVR:1;
            } B;
		} SR;

        union {                  /* Module Extended Config Register */
            uint32_t R;
            struct {
            	uint32_t SDMAE:1;
            	uint32_t SSIG:1;
            	uint32_t SSAT:1;
            	uint32_t SCSAT:1;
            	uint32_t:10;
                uint32_t SRQ:1;
                uint32_t SZR0:1;
                uint32_t:1;
                uint32_t SISEL:1;
            	uint32_t SZROSEL:2;
            	uint32_t:2;
				uint32_t SHLTSEL:2;
            	uint32_t:1;
                uint32_t SRQSEL:3;
            	uint32_t:2;
				uint32_t SENSEL:2;
            } B;
        } MXCR;

        union {                  /* Module Extended Status Register */
            uint32_t R;
            struct {
                uint32_t:7;
                uint32_t SDFC:1;
                uint32_t:2;
                uint32_t SSEC:1;
                uint32_t SCEC:1;
                uint32_t:1;
                uint32_t SSOVFC:1;
                uint32_t SCOVFC:1;
                uint32_t SVRC:1;
                uint32_t:7;
                uint32_t SDF:1;
                uint32_t:2;
                uint32_t SSE:1;
                uint32_t SCE:1;
                uint32_t:1;
                uint32_t SSOVF:1;
                uint32_t SCOVF:1;
                uint32_t SVR:1;
 	      } B;
        } MXSR;

        union {                  /* Interface Input Buffer Register */
            uint32_t R;
            struct {
                uint32_t:14;
                uint32_t PREFILL:1;
                uint32_t FLUSH:1;
                uint32_t INPBUF:16;
            } B;
        } IB;

        union {                  /* Interface Output Buffer Register */
            uint32_t R;
            struct {
                uint32_t:9;
                uint32_t TSI:1;
                uint32_t:2;
                uint32_t OUTTAG:4;
                uint32_t OUTBUF:16;
            } B;
        } OB;

        uint32_t DFILT_reserved0018[2];  /* 0x0018-0x001F */

        union {                  /* Coefficient n Register */
            int32_t R;
            struct {
                int32_t:8;
                int32_t COEF:24;
            } B;
        } COEF[9];

        uint32_t DFILT_reserved0044[13];  /* 0x0044-0x0077 */

        union {                  /* TAP n Register */
            int32_t R;
            struct {
                int32_t:8;
                int32_t TAP:24;
            } B;
        } TAP[8];

        uint32_t DFILT_reserved0098[14]; /* 0x0098-0x00CF */

        union {                  /* EDID Register */
            uint32_t R;
            struct {
                uint32_t:16;
                uint32_t SAMP_DATA:16;
            } B;
        } EDID;

