RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc567x.h
        uint32_t DFILT_reserved00D4[459]; /* 0x00D4-0x07FF */

    };

/****************************************************************************/
/*                          MODULE : DSPI                                   */
/****************************************************************************/

    struct DSPI_tag {

        union DSPI_MCR_tag {     /* Module Configuration Register */
            uint32_t R;
            struct {
                uint32_t MSTR:1;
                uint32_t CONT_SCKE:1;
                uint32_t DCONF:2;
                uint32_t FRZ:1;
                uint32_t MTFE:1;
                uint32_t PCSSE:1;
                uint32_t ROOE:1;
                uint32_t PCSIS7:1;
                uint32_t PCSIS6:1;
                uint32_t PCSIS5:1;
                uint32_t PCSIS4:1;
                uint32_t PCSIS3:1;
                uint32_t PCSIS2:1;
                uint32_t PCSIS1:1;
                uint32_t PCSIS0:1;
                uint32_t DOZE:1;
                uint32_t MDIS:1;
                uint32_t DIS_TXF:1;
                uint32_t DIS_RXF:1;
                uint32_t CLR_TXF:1;
                uint32_t CLR_RXF:1;
                uint32_t SMPL_PT:2;
                uint32_t:7;
                uint32_t HALT:1;
            } B;
        } MCR;

        uint32_t DSPI_reserved0004;  /* 0x0004-0x0007 */

        union {              /* Transfer Count Register */
            uint32_t R;
            struct {
                uint32_t TCNT:16;
                uint32_t:16;
            } B;
        } TCR;

        union DSPI_CTAR_tag {/* Clock and Transfer Attributes Registers */
            uint32_t R;
            struct {
                uint32_t DBR:1;
                uint32_t FMSZ:4;
                uint32_t CPOL:1;
                uint32_t CPHA:1;
                uint32_t LSBFE:1;
                uint32_t PCSSCK:2;
                uint32_t PASC:2;
                uint32_t PDT:2;
                uint32_t PBR:2;
                uint32_t CSSCK:4;
                uint32_t ASC:4;
                uint32_t DT:4;
                uint32_t BR:4;
            } B;
        } CTAR[8];

        union DSPI_SR_tag {       /* Status Register */
            uint32_t R;
            struct {
                uint32_t TCF:1;
                uint32_t TXRXS:1;
                uint32_t:1;
                uint32_t EOQF:1;
                uint32_t TFUF:1;
                uint32_t:1;
                uint32_t TFFF:1;
                uint32_t:5;
                uint32_t RFOF:1;
                uint32_t:1;
                uint32_t RFDF:1;
                uint32_t:1;
                uint32_t TXCTR:4;
                uint32_t TXNXTPTR:4;
                uint32_t RXCTR:4;
                uint32_t POPNXTPTR:4;
            } B;
        } SR;

        union DSPI_RSER_tag {   /* DMA/Interrupt Request Select and Enable Register */
            uint32_t R;
            struct {
                uint32_t TCFRE:1;
                uint32_t:2;
                uint32_t EOQFRE:1;
                uint32_t TFUFRE:1;
                uint32_t:1;
                uint32_t TFFFRE:1;
                uint32_t TFFFDIRS:1;
                uint32_t:4;
                uint32_t RFOFRE:1;
                uint32_t:1;
                uint32_t RFDFRE:1;
                uint32_t RFDFDIRS:1;
                uint32_t:16;
            } B;
        } RSER;

        union DSPI_PUSHR_tag { /* PUSH TX FIFO Register */
            uint32_t R;
            struct {
                uint32_t CONT:1;
                uint32_t CTAS:3;
                uint32_t EOQ:1;
                uint32_t CTCNT:1;
                uint32_t:2;
                uint32_t PCS7:1;
                uint32_t PCS6:1;
                uint32_t PCS5:1;
                uint32_t PCS4:1;
                uint32_t PCS3:1;
                uint32_t PCS2:1;
                uint32_t PCS1:1;
                uint32_t PCS0:1;
                uint32_t TXDATA:16;
            } B;
        } PUSHR;

        union DSPI_POPR_tag {   /* POP RX FIFO Register */
            uint32_t R;
            struct {
                uint32_t:16;
                uint32_t RXDATA:16;
            } B;
        } POPR;

        union {              /* Transmit FIFO Registers */
            uint32_t R;
            struct {
                uint32_t TXCMD:16;
                uint32_t TXDATA:16;
            } B;
        } TXFR[4];

        uint32_t DSPI_reserved004C[12]; /* 0x004C-0x007B */

        union {              /* Transmit FIFO Registers */
            uint32_t R;
            struct {
                uint32_t:16;
                uint32_t RXDATA:16;
            } B;
        } RXFR[4];

        uint32_t DSPI_reserved008C[12]; /* 0x008C-0x00BB */

        union {                /* DSI Configuration Register */
            uint32_t R;
            struct {
                uint32_t MTOE:1;
                uint32_t:1;
                uint32_t MTOCNT:6;
                uint32_t:3;
                uint32_t TSBC:1;
                uint32_t TXSS:1;
                uint32_t TPOL:1;
                uint32_t TRRE:1;
                uint32_t CID:1;
                uint32_t DCONT:1;
                uint32_t DSICTAS:3;
                uint32_t:4;
                uint32_t DPCS7:1;
                uint32_t DPCS6:1;
                uint32_t DPCS5:1;
                uint32_t DPCS4:1;
                uint32_t DPCS3:1;
                uint32_t DPCS2:1;
                uint32_t DPCS1:1;
                uint32_t DPCS0:1;
            } B;
        } DSICR;

        union {                  /* DSI Serialization Data Register */
            uint32_t R;
            struct {
                uint32_t SER_DATA:32;
            } B;
        } SDR;

        union {                 /* DSI Alternate Serialization Data Register */
            uint32_t R;
            struct {
                uint32_t ASER_DATA:32;
            } B;
        } ASDR;

        union {                /* DSI Transmit Comparison Register */
            uint32_t R;
            struct {
                uint32_t COMP_DATA:32;
            } B;
        } COMPR;

        union {                  /* DSI deserialization Data Register */
            uint32_t R;
            struct {
                uint32_t DESER_DATA:32;
            } B;
        } DDR;

        union {
            uint32_t R;
            struct {
                uint32_t:3;
                uint32_t TSBCNT:5;
                  uint32_t:16;
                uint32_t DPCS1_7:1;
                uint32_t DPCS1_6:1;
                uint32_t DPCS1_5:1;
                uint32_t DPCS1_4:1;
                uint32_t DPCS1_3:1;
                uint32_t DPCS1_2:1;
                uint32_t DPCS1_1:1;
                uint32_t DPCS1_0:1;
            } B;
        } DSICR1;
        uint32_t DSPI_reserved00D4[4043];  /* 0x00D4-0x3FFF */

