RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc567x.h
    };

/****************************************************************************/
/*                          MODULE : eSCI                                   */
/****************************************************************************/

    struct ESCI_tag {
        union ESCI_CR1_tag {     /* Control Register 1 */
            uint32_t R;
            struct {
                uint32_t:3;
                uint32_t SBR:13;
                uint32_t LOOPS:1;
                uint32_t:1;
                uint32_t RSRC:1;
                uint32_t M:1;
                uint32_t WAKE:1;
                uint32_t ILT:1;
                uint32_t PE:1;
                uint32_t PT:1;
                uint32_t TIE:1;
                uint32_t TCIE:1;
                uint32_t RIE:1;
                uint32_t ILIE:1;
                uint32_t TE:1;
                uint32_t RE:1;
                uint32_t RWU:1;
                uint32_t SBK:1;
            } B;
        } CR1;

        union ESCI_CR2_tag {     /* Control Register 2 */
            uint16_t R;
            struct {
                uint16_t MDIS:1;
                uint16_t FBR:1;
                uint16_t BSTP:1;
                uint16_t IEBERR:1;
                uint16_t RXDMA:1;
                uint16_t TXDMA:1;
                uint16_t BRK13:1;
                uint16_t TXDIR:1;
                uint16_t BESM13:1;
                uint16_t SBSTP:1;
                uint16_t RXPOL:1;
                uint16_t PMSK:1;
                uint16_t ORIE:1;
                uint16_t NFIE:1;
                uint16_t FEIE:1;
                uint16_t PFIE:1;
            } B;
        } CR2;

        union ESCI_DR_tag {       /* Data Register */
            uint16_t R;

            struct {
                uint16_t RN:1;
                uint16_t TN:1;
                uint16_t ERR:1;
                uint16_t:1;
                uint16_t RD_11:4;
                uint16_t D:8;
            } B;
        } DR; /* Legacy naming - refer to SDR in Reference Manual */

        union ESCI_SR_tag {       /* Status Register */
            uint32_t R;
            struct {
                uint32_t TDRE:1;
                uint32_t TC:1;
                uint32_t RDRF:1;
                uint32_t IDLE:1;
                uint32_t OR:1;
                uint32_t NF:1;
                uint32_t FE:1;
                uint32_t PF:1;
                uint32_t:3;
                uint32_t BERR:1;
                uint32_t:2;
                uint32_t TACT:1;
                uint32_t RAF:1;
                uint32_t RXRDY:1;
                uint32_t TXRDY:1;
                uint32_t LWAKE:1;
                uint32_t STO:1;
                uint32_t PBERR:1;
                uint32_t CERR:1;
                uint32_t CKERR:1;
                uint32_t FRC:1;
                uint32_t:6;
                uint32_t UREQ:1;
                uint32_t OVFL:1;
            } B;
        } SR;

        union {                  /* LIN Control Register */
            uint32_t R;
            struct {
                uint32_t LRES:1;
                uint32_t WU:1;
                uint32_t WUD0:1;
                uint32_t WUD1:1;
                uint32_t :2;
                uint32_t PRTY:1;
                uint32_t LIN:1;
                uint32_t RXIE:1;
                uint32_t TXIE:1;
                uint32_t WUIE:1;
                uint32_t STIE:1;
                uint32_t PBIE:1;
                uint32_t CIE:1;
                uint32_t CKIE:1;
                uint32_t FCIE:1;
                uint32_t:6;
                uint32_t UQIE:1;
                uint32_t OFIE:1;
                uint32_t:8;
            } B;
        } LCR;

        union {                  /* LIN Transmit Register */
            uint8_t R;
        } LTR;

        uint8_t eSCI_reserved0011[3];  /* 0x0011-0x0013 */

        union {                  /* LIN Recieve Register */
            uint8_t R;
            struct {
                uint8_t D:8;
            } B;
        } LRR;

        uint8_t eSCI_reserved0015[3];  /* 0x0015-0x0017 */

        union {                  /* LIN CRC Polynom Register  */
            uint16_t R;
            struct {
                uint16_t P:16;
            } B;
        } LPR;

        union {                  /* Control Register 3 */
            uint16_t R;
            struct {
                uint16_t:3;
                uint16_t SYNM:1;
                uint16_t EROE:1;
                uint16_t ERFE:1;
                uint16_t ERPE:1;
                uint16_t M2:1;
                uint16_t:8;
            } B;
        } CR3;

        uint32_t eSCI_reserved001C; /* 0x001C-0x001F */

        uint32_t eSCI_reserved0020[4088];  /* 0x0020-0x3FFF */

    };

/****************************************************************************/
/*                          MODULE : FlexCAN                                */
/****************************************************************************/

    struct FLEXCAN2_tag {
        union {                  /* Module Configuration Register */
            uint32_t R;
            struct {
                uint32_t MDIS:1;
                uint32_t FRZ:1;
                uint32_t FEN:1;
                uint32_t HALT:1;
                uint32_t NOTRDY:1;
                uint32_t WAK_MSK:1;
                uint32_t SOFTRST:1;
                uint32_t FRZACK:1;
                uint32_t SUPV:1;
                uint32_t SLF_WAK:1;
                uint32_t WRNEN:1;
                uint32_t MDISACK:1;
                uint32_t WAK_SRC:1;
                uint32_t DOZE:1;
                uint32_t SRXDIS:1;
                uint32_t BCC:1;
                uint32_t:2;
                uint32_t LPRIO_EN:1;
                uint32_t AEN:1;
                uint32_t:2;
                uint32_t IDAM:2;
                uint32_t:2;
                uint32_t MAXMB:6;
            } B;
        } MCR;

        union {                   /* Control Register */
            uint32_t R;
            struct {
                uint32_t PRESDIV:8;
                uint32_t RJW:2;
                uint32_t PSEG1:3;
                uint32_t PSEG2:3;
                uint32_t BOFFMSK:1;
                uint32_t ERRMSK:1;
                uint32_t CLKSRC:1;
                uint32_t LPB:1;
                uint32_t TWRNMSK:1;
                uint32_t RWRNMSK:1;
                uint32_t:2;
                uint32_t SMP:1;
                uint32_t BOFFREC:1;
                uint32_t TSYN:1;
                uint32_t LBUF:1;
                uint32_t LOM:1;
                uint32_t PROPSEG:3;
            } B;
        } CR; /* Legacy naming - refer to CTRL in Reference Manual */

        union {                /* Free Running Timer */
            uint32_t R;
        } TIMER;

        int32_t FLEXCAN_reserved000C;  /* 0x000C-0x000F */

        union {              /* RX Global Mask */
            uint32_t R;
            struct {
                uint32_t MI31:1;
                uint32_t MI30:1;
                uint32_t MI29:1;
                uint32_t MI28:1;
                uint32_t MI27:1;
                uint32_t MI26:1;
                uint32_t MI25:1;
                uint32_t MI24:1;
                uint32_t MI23:1;
                uint32_t MI22:1;
                uint32_t MI21:1;
                uint32_t MI20:1;
                uint32_t MI19:1;
                uint32_t MI18:1;
                uint32_t MI17:1;
                uint32_t MI16:1;
                uint32_t MI15:1;
                uint32_t MI14:1;
                uint32_t MI13:1;
                uint32_t MI12:1;
                uint32_t MI11:1;
                uint32_t MI10:1;
                uint32_t MI9:1;
                uint32_t MI8:1;
                uint32_t MI7:1;
                uint32_t MI6:1;
                uint32_t MI5:1;
                uint32_t MI4:1;
                uint32_t MI3:1;
                uint32_t MI2:1;
                uint32_t MI1:1;
                uint32_t MI0:1;
            } B;
        } RXGMASK;

        union {             /* RX 14 Mask */
            uint32_t R;
            struct {
                uint32_t MI31:1;
                uint32_t MI30:1;
                uint32_t MI29:1;
                uint32_t MI28:1;
                uint32_t MI27:1;
                uint32_t MI26:1;
                uint32_t MI25:1;
                uint32_t MI24:1;
                uint32_t MI23:1;
                uint32_t MI22:1;
                uint32_t MI21:1;
                uint32_t MI20:1;
                uint32_t MI19:1;
                uint32_t MI18:1;
                uint32_t MI17:1;
                uint32_t MI16:1;
                uint32_t MI15:1;
                uint32_t MI14:1;
                uint32_t MI13:1;
                uint32_t MI12:1;
                uint32_t MI11:1;
                uint32_t MI10:1;
                uint32_t MI9:1;
                uint32_t MI8:1;
                uint32_t MI7:1;
                uint32_t MI6:1;
                uint32_t MI5:1;
                uint32_t MI4:1;
                uint32_t MI3:1;
                uint32_t MI2:1;
                uint32_t MI1:1;
                uint32_t MI0:1;
            } B;
        } RX14MASK;

        union {             /* RX 15 Mask */
            uint32_t R;
            struct {
                uint32_t MI31:1;
                uint32_t MI30:1;
                uint32_t MI29:1;
                uint32_t MI28:1;
                uint32_t MI27:1;
                uint32_t MI26:1;
                uint32_t MI25:1;
                uint32_t MI24:1;
                uint32_t MI23:1;
                uint32_t MI22:1;
                uint32_t MI21:1;
                uint32_t MI20:1;
                uint32_t MI19:1;
                uint32_t MI18:1;
                uint32_t MI17:1;
                uint32_t MI16:1;
                uint32_t MI15:1;
                uint32_t MI14:1;
                uint32_t MI13:1;
                uint32_t MI12:1;
                uint32_t MI11:1;
                uint32_t MI10:1;
                uint32_t MI9:1;
                uint32_t MI8:1;
                uint32_t MI7:1;
                uint32_t MI6:1;
                uint32_t MI5:1;
                uint32_t MI4:1;
                uint32_t MI3:1;
                uint32_t MI2:1;
                uint32_t MI1:1;
                uint32_t MI0:1;
            } B;
        } RX15MASK;

        union {                  /* Error Counter Register */
            uint32_t R;
            struct {
                uint32_t:16;
                uint32_t RXECNT:8;
                uint32_t TXECNT:8;
            } B;
        } ECR;

